{
  "domain": "tech",
  "description": "The 6 best note-taking apps in 2025\nThese Evernote alternatives are the best out there. By Harry Guinness · December 9, 2024\nHero image with logos of the best note-taking apps\nNote taking is one of those universal but intensely personal things. Everyone has a note-taking method of some kind, whether it's as simple as writing down a grocery list or phone number on your hand or as systematic as typing up detailed book summaries or meeting minutes in a carefully organized app....",
  "full_text": "The 6 best note-taking apps in 2025\nThese Evernote alternatives are the best out there.\nBy Harry Guinness · December 9, 2024\nHero image with logos of the best note-taking apps\nNote taking is one of those universal but intensely personal things. Everyone has a note-taking method of some kind, whether it's as simple as writing down a grocery list or phone number on your hand or as systematic as typing up detailed book summaries or meeting minutes in a carefully organized app.\n\nFor some people, notes are just text—maybe with a few headings and bullets; for others, they're essentially scrapbooks with elaborate doodles and images. But however you take notes, there's an app out there that can handle all your weird quirks, obscure preferences, and note-taking needs. You just might need to look for it.\n\nBut first, the big caveat. You can write notes anywhere: on the back of a napkin, envelope, important bill, or even in a notebook. It's kind of similar with apps: you can stick notes into pretty much any old app, even if it's not really designed for them. Example: Google Docs isn't a great notes app, but I have notes about this article you're reading now in the Google Doc I'm working from.\n\nTurn ideas into action\nAutomate your note-taking\nSo for this list, I didn't look at every app that could be used to take notes, every app I've personally used to take notes, or even every business collaboration tool that claimed it was a notes app—I was only interested in apps that were explicitly designed to be notes apps. I also only really considered general-purpose personal note-taking apps.\n\nEven with all these criteria in place, I still tested over 50 different note apps for taking notes online. Here are the best note-taking apps I could find.\n\nThe best note-taking apps\nMicrosoft OneNote for a free note-taking app\n\nApple Notes for Apple users\n\nGoogle Keep for Google power users\n\nNotion for collaboration\n\nObsidian for power note-takers\n\nJoplin for an Evernote alternative\n\nOnce you've picked a note-taking app, check out our favorite ways to use automation to improve how you put your notes to work, track action items from meetings, and put an end to regular copy-paste actions.\n\nWhat makes the best note-taking app?\nHow we evaluate and test apps\nOur best apps roundups are written by humans who've spent much of their careers using, testing, and writing about software. Unless explicitly stated, we spend dozens of hours researching and testing apps, using each app as it's intended to be used and evaluating it against the criteria we set for the category. We're never paid for placement in our articles from any app or for links to any site—we value the trust readers put in us to offer authentic evaluations of the categories and apps we review. For more details on our process, read the full rundown of how we select apps to feature on the Zapier blog.\n\nAs a tech writer, I've been taking notes and reviewing software every day for well over a decade. Note taking is something I have opinions about. Even after all this, I'm still fine-tuning the system I use. I've done my best to leave my preferences out of the decision-making process here. For example, while I love text-heavy notes apps with support for Markdown (which shouldn't really be a surprise), I recognize that other people are looking for different things. If your favorite app isn't on the list, feel free to shout into the void.\n\nWith so many apps to consider—and so many apps claiming to be notes apps—I had some pretty strict criteria for what made an app worthy of this list.\n\nFirst, the best note-taking software has to be good at what it claims to do. This sounds like an easy bar to clear, but you'd be surprised at how many apps fell short. Not every note-taking app needs to have features like image-to-text conversion or stylus support, but if it boasted about them on its marketing page, they had better be well-executed and nice to use. \n\nSecond, all the note-taking apps had to be quick and easy to use as intended. The real competition when you're looking for somewhere to write a note isn't other note-taking apps, but a pen and scrap of paper. If it wasn't almost as convenient to open the notes app and create a quick note as it was to reach across my desk for an index card and a pen, it didn't make the cut. This rule also extended to other features: editing and sorting notes had to feel seamless and natural, rather than require a battle with a horrible user interface. \n\nSimilarly, the biggest reason to have a notes app instead of a physical notebook is that you can access it from anywhere on any device at any time, whether you're at your desk at work, chilling on your couch at home, or flying coast-to-coast. At a minimum, I required each notepad app to be available on one desktop and one mobile platform (and sync between them), and to have some kind of offline functionality. You can't be locked out of a notebook because you don't have Wi-Fi, and the same should be true of notes apps.\n\nFinally, we had the value for money test. I love a good free app, but with things as permanent as digital notes, that has to be balanced against the likelihood of the service surviving the next few years and being able to offer server-based features like syncing. While you will find free note-taking apps on this list, some of the best apps not operated by large technology companies charge a reasonable subscription price, and as long as it was warranted by the features offered, that was no barrier to inclusion. With that said, the more an app charged, the more I expected of it in terms of features and polish. Free and cheap apps don't have to have every possible use case covered, but if an app is charging $20/month, it better bring something big to the table.\n\nAs you can imagine, these criteria exclude a lot of apps that people love.\n\nIf you live at your desk, then an online-only web-based note-taking app might not be a problem for you, but it's just not suitable for anyone who wants to check their grocery list on their smartphone when they're at the store. \n\nThere are some great super-niche notes apps designed for fiction writers or developers, but they aren't fit for most people, so they weren't in consideration for a place on this list.\n\nSimilarly, there are lots of powerful business collaboration tools that claim to be notes apps but just aren't suitable for one person to keep track of their grocery list or draft a thank-you note. (As a rule, if an app supports video calls out of the box, it's not a notes app.)\n\nThe other thing that's popped up in the last two years are AI-powered note-taking apps. These typically claim to either help you write better notes or resurface the information you record in novel ways. While AI features were a nice bonus, to make the list, every app still had to work well as a regular note-taking app too.\n\nOver the course of a few days, instead of using my notebook or notes app of choice, I wrote my thoughts, lists, and other notes to remember down in one of the apps I was putting through its paces. For any that looked like they might make the list, I dug a bit deeper and tested the other features like sync, sorting, and the like. Here are my favorites.\n\nThe best note-taking apps at a glance\nBest for\n\nStandout feature\n\nFree plan\n\nMicrosoft OneNote\n\nA free option\n\nVery freeform—click anywhere to add text\n\nFree for up to 5GB of notes\n\nApple Notes\n\nApple users\n\nVery native-feeling on Macs and iPhones, with easy syncing\n\nFree for 5GB of storage across all iCloud services\n\nGoogle Keep\n\nGoogle power users\n\nConnected to all the Google apps, so everything is always right there\n\nFree for 15GB of storage across all of Google apps\n\nNotion\n\nCollaboration\n\nRidiculously feature-rich\n\nFree for personal use\n\nObsidian\n\nTinkerers and power note-takers\n\nInternal bi-directional linking between notes\n\nFree for personal use\n\nJoplin\n\nAnyone looking for an Evernote alternative\n\nOpen source\n\nFree\n\nBest free note-taking app\nMicrosoft OneNote (iOS, Android, macOS, Windows, Web)\nThe interface for OneNote, our pick for the best free note-taking app\nOneNote pros:\n\nA great free plan that's widely available on every platform \n\nCompletely freeform note-taking, so you can jot down whatever you want wherever you want to on the canvas \n\nOneNote cons:\n\nIt's still a Microsoft app, so it can feel a bit corporate for a note-taking app\n\nMicrosoft OneNote is the best free note-taking app and in serious contention to be the best note-taking app overall. Unless you know you want a specific set of features that it doesn't offer, it's the first app that most people should try.\n\nOneNote is incredibly freeform when it comes to taking notes, which allows it to adapt to whatever your specific needs are. Each notebook is modeled off a ringbinder, so it's divided into sections with subsections called pages. And each page is basically a canvas where you can add any kind of note you like, anywhere you want. You can throw in some images, click anywhere to add text notes, and if your computer supports a stylus, scribble a mustache on everyone in the photo. (Otherwise you can draw one on with your trackpad, but it'll be less stylish.) It feels like a solution purpose-built for students and anyone else who has to take long, discursive notes about something or doodle a few diagrams, rather than people looking for a digital notebook to collect short snippets and random ideas.\n\nI'd struggle to call any of Microsoft's apps intuitive, but OneNote is familiar. If you've used any version of Word, Excel, or PowerPoint in the last decade, you'll be right at home. It's certainly better for sitting down and taking notes during a class or meeting than scrawling reminders at a grocery store, but it can do both. \n\nMicrosoft—through its partnership with OpenAI—is one of the biggest proponents of AI, and it's added an AI assistant called Copilot to most of its apps. In OneNote, Copilot is able to create, summarize, and edit text, as well as help you understand your notes. For now, it's only available to Microsoft 365 Copilot (Work) and Copilot Pro (Home) customers using the Windows app, so it didn't really factor into my decision-making process for this year's list, but if you're an enterprise OneNote user, it's worth a look.\n\nIn terms of pricing, although OneNote is free, it uses your OneDrive storage. You get 5GB included, which is more than enough for most people. But if you use OneDrive to store your photos, or save a lot of image and audio notes, you might hit against that limit. If you do, you can increase it to 100GB for $1.99/month. (You can also sign up for Microsoft 365 from $6.99/month and get the full Office suite of apps and more storage, but which plan is right for you can get complicated.) Similarly, Copilot starts at $20/month.\n\nWith OneNote's Zapier integration, you can automate OneNote to eliminate the hassle of moving information between apps. For example, Zapier can automatically create new notes in OneNote whenever you have a new task, note, or calendar event in another app. Learn more about how to automate OneNote, or get started with one of these pre-made workflows.\n\nAdd notes on OneNote for upcoming Google Calendar events\nTry it\nGoogle Calendar, OneNote\nGoogle Calendar + OneNote\nMore details\nAdd new OneNote notes to Notion as pages\nTry it\nOneNote, Notion\nOneNote + Notion\nMore details\nCreate notes in OneNote for new recordings added in tl;dv\nTry it\ntl;dv, OneNote\ntl;dv + OneNote\nMore details\nOneNote price: Free for up to 5GB of notes; $1.99/month for 100GB; AI features with Copilot from $20/month.\n\nTake a look at how OneNote compares to Evernote in our Evernote vs. OneNote showdown.\n\nBest note-taking app for Apple users\nApple Notes (iOS, macOS, Web)\nThe interface for Apple Notes, our pick for the best note-taking app for Apple users\nApple Notes pros:\n\nFree and integrates seamlessly between your Apple devices \n\nConsistently improving; it used to be incredibly basic, but now it's a competent notes app \n\nApple Notes cons:\n\nGetting it to play nice with Android or Windows is a fool's errand\n\nIf you're firmly entrenched in Apple's ecosystem, you don't have to look too far for a great, free note-taking app. Apple Notes (variously called Notes or iCloud Notes, depending on how you're accessing it) is built into macOS and iOS, and can also be used through your browser. Just head to icloud.com/notes, and you get an online version of the app with all your synced notes—even if you're on a PC or Chromebook. It's a nice bonus that keeps your notes from being totally locked into your Apple devices.\n\nThere are actually lots of incredible note-taking apps available on Macs, iPads, and iPhones. I could legitimately have filled this spot with picks like Bear and Craft (both of which I love), but Apple Notes takes it because it is free and built in. Plus, it's as convenient, easy to use, and as useful for most people as any of the premium picks.\n\nAnd it keeps getting better. Over the past few years, Apple has added features like tags, sharing, and a powerful search. You can add text to your notes, record audio and get live transcripts, attach images, scan documents, draw or handwrite, and basically format them as you need. It even solves math problems. And with Apple Intelligence, it can do things like generate images and help you rewrite text (but the AI isn't quite as powerful as in some other notes apps).\n\nIf you've got an iPhone, iPad, or Mac, Apple Notes is the first app to try. Everything syncs easily and, in that classic Apple way, just works. It isn't the most feature-filled app, but for most occasional note takers, it does more than enough.\n\nApple Notes price: Free for 5GB of storage across all iCloud services; starts at $0.99/month for 50GB. \n\nThere's a very healthy notes app ecosystem for Apple devices; however, since they're all paid products and Apple Notes is so good, none of them made this list. For more options, check out our picks for the best Mac note-taking apps and the best iPad note-taking apps.\n\nBest note app for Google power users\nGoogle Keep (Android, iOS, Web, Chrome)\nThe interface for Google Keep, our pick for the best note-taking app for Google power users\nGoogle Keep pros:\n\nIntegrates nicely with other Google services like Gmail and Google Docs \n\nFree as part of a regular Google account \n\nGoogle Keep cons:\n\nOn its own, it's very basic\n\nMost notes aren't supposed to stand alone—they serve a purpose. They're meant to remind you to email a friend, help you outline your new book, or one of a million other things. Often, these other things require you to use some other app or service. You can't send an email from your notes app, and while you might be able to outline a book, it's probably not the best place to write it. This is what makes Google Keep such a great option for Google power users.\n\nGoogle Keep is a little odd. As a notes app, it's fine—though very barebones. There are reasonable web, iOS, and Android versions, and a handy Chrome extension for saving quick notes and links. But it's how it integrates with Google's other services that makes it so useful. \n\nIf you use Google Keep, when you open Gmail in your browser, there's a little lightbulb icon in the right sidebar. Click it, and you have quick access to all your Google Keep notes. You can see any notes related to the thing you're working on, find your most recent notes, search for something from a while ago, or create a new one. But here's the thing: that same sidebar is there in all of your Google Docs, in your Google Calendar, and even in your Google Drive. About the only Google app it isn't in is YouTube.\n\nAnd Keep integrates with the rest of Google in other ways. Click on a note and then select Copy to Google Docs to convert it into a new document (you can also drag and drop a note from the sidebar if you have Google Docs open); set a reminder by clicking the little bell icon, and the note appears in your Google Calendar; if you create an audio note on your smartphone, Google automatically transcribes it; and you can even use Google's Gemini chatbot to create notes based off your conversations.\n\nReally, if you live your work life in Google's ecosystem, you should be using Keep—even if you also use another note-taking solution for your personal life. It comes as part of your Google account and is perfect for any notes you need in the other Google apps. It isn't Google's biggest priority, but it doesn't seem to be anywhere close to being axed.\n\nGoogle Keep price: Free for 15GB of storage across all of Google apps; starts at $1.99/month for 100GB.\n\nBest note-taking website for collaboration\nNotion (Android, iOS, macOS, Windows, Web)\nThe interface for Notion, our pick for the best note-taking app for collaboration\nNotion pros:\n\nBest-in-class collaboration and team note-taking features\n\nPacks in lots of features, like task management, databases, and pretty much anything else you care to think of \n\nNotion cons:\n\nIf you're looking for a personal note-taking app, it can be a bit over the top\n\nNote taking can be something you do for yourself, or something you do with and for others—whether they're your coworkers, fellow students, or just friends and family members. All the apps we've looked at so far are mostly for taking notes for yourself. Sure, you can share and collaborate on notes and even notebooks, but their main features lie elsewhere. With Notion, collaboration on all aspects is built in from the start (though it can still be used solo).\n\nNotion is the only app on this list that skirts the provision of it being a note-taking app. It is, but because of its collaborative features, it can be so much more. It's basically three tools in one: a powerful notes app (which is why it's on this list), a task and project manager, and a reference wiki. How you combine those three things is up to you. \n\nEach new document or note is called a page, and everything in Notion is referred to as a block. Blocks include basic elements like text, checklists, and headings, as well as media types like images, web bookmarks, video, audio, code snippets, and files. You can use as many blocks as you want, in whatever combination, on every page. The sidebar is split into two sections: Teamspaces, which groups all the pages you share with the rest of your team, and Private, where you can have your own notes. While collaboration is a big part of Notion, it's not forced on you.\n\nNotion is also really embracing AI. While you can try it for free, it costs $10/month to enable unlimited access. It can generate and edit text, but more usefully, it can also summarize and pull action items from meeting notes, transcriptions, and anything else you like. You can also ask a chatbot for information about your notes, and it will summarize the content and link to the relevant documents. It's similar to what Mem does, and should make it easier to find and pull content from your notes. (Mem also has powerful AI features worth checking out, but it's not as easy to use as a regular notes app.)\n\nOne thing to note: Notion bills itself as an Evernote competitor for personal users. It can be—but it's too much for most people, and its offline functionality isn't the best. If you love the idea of Notion, go right ahead and try the free Personal Plan, but for me, it's really best as a team notes app or an AI-powered notes app. Something like Obsidian (which we'll look at in a moment) or Craft have a lot of Notion's best features, but they're tailored for individuals.\n\nNotion integrates with Zapier, so you can connect it to thousands of other apps to do things like automatically generate tasks from new Notion database items, or send calendar events to Notion. Learn more about how to automate Notion, or check out these templates for inspiration.\n\nAdd new Google Calendar events to databases in Notion\nTry it\nGoogle Calendar, Notion\nGoogle Calendar + Notion\nMore details\nCreate pages in Notion for new tl;dv recordings\nTry it\ntl;dv, Notion\ntl;dv + Notion\nMore details\nCreate pages in Notion for new tl;dv transcripts\nTry it\ntl;dv, Notion\ntl;dv + Notion\nMore details\nNotion price: Free for personal users; free trial for team users with a 1,000 block limit; from $12/user/month for the Plus plan with unlimited blocks. Notion AI starts at $10/user/month.\n\nIf you're deciding between Notion and OneNote, take a look at our showdown: Notion vs. OneNote.\n\nBest notes app for power note-takers\nObsidian (Android, iOS, macOS, Windows, Linux)\nThe interface for Obsidian, our pick for the best note-taking app for power note-takers\nObsidian pros:\n\nA modern way of approaching note-taking that allows you to create an interlinked digital database\n\nIncredibly extensible and customizable\n\nObsidian cons:\n\nThere's a serious learning curve\n\nObsidian is one of a modern category of note-taking apps that pushes the boundaries of what a note-taking app can—and should—do. Along with Notion, Roam Research (which didn't make this list because of its high price and barrier to entry), and a handful of other apps, it strives to be an all-encompassing digital database for your life—and kind of pulls it off. \n\nObsidian has a much steeper learning curve than the other apps on this list, so only check it out if you're prepared to put in the work to get it set up to your needs. At its core, it's a notes app that offers both Markdown-formatted text notes and more freeform, OneNote-style Canvas notes, but things can get more complicated quickly. Certainly, if you try to use it as a basic notes app, you'll be a bit disappointed with it.\n\nWith Obsidian, you can sort your notes into folders and subfolders using the sidebar like you would with a normal notes app, but more interestingly, you can link between them using internal hyperlinks. Typing [[ brings up a dialog box that lets you select any other note to link to. This means you can easily reference notes you've previously created; for example, you can create a list of all the books you've read in the last year and link to the notes where you review them. And in the sidebar for every note, you can see all the notes linking to the current note and all the notes it links out to. There's a Graph view that visualizes all these links too. It's this connection-focused approach that makes Obsidian so fascinating—but also so inscrutable. Either you love the idea, or it's a needlessly complicated way to make grocery lists; there's very little middle ground.\n\nOn top of that, you can basically customize anything you want. You have total control over the interface and can have as many notes as you want open in the same window. There are even community plugins, which add features—like a Kanban board, AI chatbots, and most other things you can think of—that take it far beyond its simple text files roots.\n\nMy colleague Justin Pot told me, \"Obsidian has literally changed my life,\" and I don't think recommendations come much stronger than that.\n\nObsidian price: Free for personal use; $50/user/year for commercial use. Premium add-ons offer services like Sync and Publish from $5/month.\n\nBest Evernote alternative\nJoplin (Android, iOS, macOS, Windows, Linux)\nJoplin, our pick for the best alternative to Evernote\nJoplin pros:\n\nThe closest direct competitor to Evernote on this list \n\nFree and open source (though syncing through Joplin Cloud is extra)\n\nJoplin cons:\n\nLess polished than the competition \n\nNot only is Joplin the best open source note-taking app on this list, but it's also the best free Evernote alternative too. For a number of reasons I'll explore below, I don't feel Evernote merits a spot on this list right now, despite some recent changes. But because Evernote has been such a staple of the note-taking app space, most other apps compete by trying to be different. OneNote is awesome, but using it is a totally different experience to using Evernote. Joplin, though, gets things pretty close—and you can import all your notebooks from Evernote.\n\nThe interface is what you'd expect from an Evernote-inspired note-taking app. Notebooks go on the left, notes are in a second column, and you view and write your notes in a third. Because Joplin fully supports Markdown (and gets a million bonus points for doing so), there's also a fourth preview column that shows you what your notes look like in rich text. Of course, this is only by default—you can turn off the preview, write in rich text, and switch things up however else you like.\n\nAs an open source app, there are a few rough edges. But really, this is me just nitpicking. A small amount of UI weirdness doesn't take away from the functionality of the app.\n\nWhile Joplin is totally free to use, you will need some kind of sync service to get your notes across all your devices. You can use a file sharing service like Dropbox or OneDrive, but there's also the official Joplin Cloud that allows you to publish your notes to the internet and collaborate with other people. Whatever option you go with, your notes are end-to-end encrypted for security. \n\nJoplin price: Free, though Joplin Cloud starts at €2.99/month and adds syncing and 2GB of storage.\n\nWhy not Evernote?\nEvernote often tops lists of best notes apps, but it isn't on this list for a few reasons:\n\nWhile Evernote was one of the apps that defined the digital note-taking category, it hasn't really been relevant for almost a decade. It was overvalued and overhyped in the mid-2010s, and even though many tech writers (including me) have fond memories of it, there are now better apps available that do similar things.\n\nEvernote is expensive. Its free plan is useless, limiting you to a single notebook on a single device with 50 notes, and at $15/month for a subscription, there are better options out there for most people.\n\nDespite an upgraded user interface and AI features, Evernote still shows its age. It just isn't as good as other apps like Obsidian or Notion. \n\nEvernote was sold at the end of 2022. While some apps survive these kinds of mergers, many don't—at least not without losing what made them great. So far, there's no strong evidence one way or the other, but it still raises a question mark over using Evernote long-term. \n\nWith all that said, I was tempted to add Evernote back to the list this year. It has been modernized a bit, and I still look fondly on the little elephant logo. But when I considered the other, better apps like Bear, Agenda, Craft, and Mem that I wasn't including on this list for various different reasons, I realized it just doesn't belong. Evernote was once great, but it isn't the best app for most people anymore.\n\nOther note-taking apps to consider\nIf none of the apps on this list are quite right, here are some others that didn't make the list for one reason or another—mostly price—but are still worth a look:\n\nAgenda is a weird note/calendar/journal hybrid. I kind of love it, but it's not for most people. \n\nCraft is like a more Apple-focused version of Notion or Obsidian. It's great, but the $10/month price tag and abundance of alternatives just keep it off the list. \n\nBear is also a nicer app than Apple Notes, but it's hard to justify even at just $3/month. If you have Apple devices and don't mind paying, give it a look.\n\nUpNote is another solid Evernote alternative that's available on every platform, though the lack of a good free plan and a few features like OCR keeps it off the list. At $1.99/month or $39.99 for a lifetime license, it's more affordable than a lot of other notes apps, though. \n\nGoodnotes is a good OneNote alternative, especially on the iPad. At $9.99/year, though, you have to want the more Apple-like feel for it to be worthwhile.\n\nMem is my favorite of the AI-powered notes apps, but proper offline support just isn't available yet, which is a major dealbreaker for me. At $14.99/month, it's also quite expensive.\n\nWhich note-taking software should you choose?\nDigital note taking is just as personal as the doodles on your high school notebook. Good note-taking apps will account for this kind of personalization, so you can do your online note taking the way that suits you.\n\nThat means the best app for notes will be the one that feels the most comfortable for you. Give a few of them a try, and see what approach you like best.\n\nAnd if none of them work: can I interest you in a pen and paper?\n\nRelated reading:\n\nThe best note-taking apps for Mac\n\nThe best note-taking apps for Android\n\nThe best note-taking apps for iPad\n\nThis post was originally published in October 2015 and previously had contributions from Emily Esposito and Jimmy Daly. The most recent update was in December 2024.\n\n",
  "filename": "best_notetaking_blog.txt",
  "information_depth": 4,
  "attention_quality": 3,
  "value_per_minute": 3,
  "novelty_index": 0,
  "spam_score": 0,
  "perspective_awareness": 3,
  "polarity_potential": 0,
  "channel_diversity": null,
  "overall_score": 2.8
}