{
  "domain": "education",
  "description": "Get your FREE sourdough starter cheat sheet! Subscribe now 👉🏻\n\nE-Mail Address\nSearch this website\nThe Clever Carrot\n\nAbout\nMeet Emilie\n \nMy Books\nArtisan Sourdough\nMy Sourdough Story\n \nThe Clever Cookbook\nA Clever Journey\n \nNewsletter\n \nSourdough\nSourdough Bread Recipes\n \nSourdough Starters\n \nSourdough Discard Recipes\n \nSourdough Tips + Techniques\n \nTo Serve With Bread\n \nHomemade Pasta\nFresh Homemade Pasta Recipes\n \nPasta Sauce\n \nHomemade Gnocchi\n \nRecipes\nSourdough Bread Recipes\n \nCookies, Cakes + Sweet Treats\n \nDinner Ideas\n \nPasta + Grains\n \nSide Dish\n \nSalads\n \nSoups\n \nSnacks\n \nShop\nAll Products\n \nBeginner Baker\n \nEmilie’s Amazon Shop\nHome » Homemade Pasta\n\nBeginner’s Guide To Fresh Homemade Pasta Dough\n5 from 32 reviews\n88 comments\nBy Emilie Raffa — December 24, 2021 (Updated June 5, 2025) — This post may contain affiliate links. Jump to Recipe\nThis easy, step-by-step fresh pasta recipe and video will teach you how to make soft, silky homemade pasta in about 1 hour (with or without a machine)....",
  "full_text": "Get your FREE sourdough starter cheat sheet! Subscribe now 👉🏻\n\nE-Mail Address\nSearch this website\nThe Clever Carrot\n\nAbout\nMeet Emilie\n \nMy Books\nArtisan Sourdough\nMy Sourdough Story\n \nThe Clever Cookbook\nA Clever Journey\n \nNewsletter\n \nSourdough\nSourdough Bread Recipes\n \nSourdough Starters\n \nSourdough Discard Recipes\n \nSourdough Tips + Techniques\n \nTo Serve With Bread\n \nHomemade Pasta\nFresh Homemade Pasta Recipes\n \nPasta Sauce\n \nHomemade Gnocchi\n \nRecipes\nSourdough Bread Recipes\n \nCookies, Cakes + Sweet Treats\n \nDinner Ideas\n \nPasta + Grains\n \nSide Dish\n \nSalads\n \nSoups\n \nSnacks\n \nShop\nAll Products\n \nBeginner Baker\n \nEmilie’s Amazon Shop\nHome » Homemade Pasta\n\nBeginner’s Guide To Fresh Homemade Pasta Dough\n5 from 32 reviews\n88 comments\nBy Emilie Raffa — December 24, 2021 (Updated June 5, 2025) — This post may contain affiliate links.\nJump to Recipe\nThis easy, step-by-step fresh pasta recipe and video will teach you how to make soft, silky homemade pasta in about 1 hour (with or without a machine). Fresh pasta is one of life’s greatest pleasures: use this versatile dough to make fettuccini, homemade lasagna noodles, ravioli, pappardelle pasta and more.\n\nFresh pasta (e.g. long fettuccini strands), coming through a Kitchen Aid stand mixer pasta attachment.\n\nFresh homemade pasta: Too hard? Too time consuming? Most people think so, just like making sourdough bread.\n\nBut really, fresh pasta is all about the dough. Master the texture (soft and smooth, not dry or crumbly!) and the rest is easy. The art and craft will captivate you. This was my pandemic activity.\n\nWhat To Expect.\nYou’ll learn how to make the classic fresh pasta recipe with flour and eggs. You can make it by hand, with a KitchenAid stand mixer, or a food processor- your choice. I’ll also share my go-to tips for storing, freezing, and cooking so your pasta turns out perfect every time.\n\nWhy This Fresh Pasta Recipe Works:\nFine-milled Italian Tipo 00 flour and eggs create a soft, supple dough that’s easy to knead by hand (61% hydration).\nA mix of whole eggs and yolk adds rich flavor and golden color.\nThis pasta dough works for lasagna noodles, homemade ravioli, pappardelle pasta and more.\nReady to branch out? Try my silky sourdough pasta or vibrant spinach pasta for exciting variations.\nA nest of fresh pasta fettuccini\nEmilie’s Fresh Pasta Tips:\nMake space. You’ll need a long, clutter-free surface to roll the dough. Pasta sheets can measure up to 3 ft long! Kitchen table is ideal.\nWeigh your ingredients (including the eggs). This gets the pasta dough texture right: soft and pliable. Too little egg? You’ll get dry and crumbly dough. Use a digital scale for accuracy. Skip the measuring cups.\nWrap it up. Pasta dough dries out fast. It can also oxidize. Keep it wrapped or covered with an upturned bowl at all times.\nFresh pasta ingredients: Brown eggs in a carton and italian Tipo 00 flour\nIngredients & Equipment You Will Need:\nItalian Tipo 00 flour: this fine milled, soft wheat Italian flour creates light, tender pasta. The texture feels like baby powder! I like Molino Grassi or Caputo. Substitute with King Arthur all purpose flour for similar results.\nLarge eggs + yolk: adds moisture, color, and flavor to the dough. Size matters. I use large eggs (~55–58g each).\nKitchen Aid Stand Mixer (w/ pasta attachments): Mix, knead, roll, and cut all in one convenient machine.\nManual Pasta Machine: Roll and cut dough by hand (non-electric).\nEggs and flour on a wood board\nFlour & eggs (well)\nMixed eggs and flour on a wood board\nMixed flour & eggs\nRough kneaded pasta dough\nPasta dough (con’t)\nSmooth ball of homemade pasta dough\nSmooth kneaded pasta dough\nBall of homemade fresh pasta dough.\nHow To Make Fresh Pasta {Step-by-Step Recipe}\nBelow, you’ll find easy instructions to make the dough by hand. I use a stand mixer with pasta attachments to roll and cut the pasta. You’ll have enough to feed 4 people, with storage tips and delicious pasta sauce pairing ideas. For a detailed, printable recipe: scroll to the end.\n\nStep #1: Make Pasta Dough\nMound the flour onto a board; make a well in the center. Crack in the eggs. Beat the eggs with a fork, then gradually incorporate the flour until the dough comes together. Finish by hand to form a rough dough. If bits of flour remain (be patient, it’s a dry dough), add a few drops of water or olive oil to help it along.\nCover and rest for 10 minutes. This step is often skipped in most recipes, but it’s essential. Coming from my bread baker’s perspective: the dough needs time to hydrate before kneading. It will be softer and easier to handle.\nNow, knead the dough for 5-7 minutes using the heel of your hand (watch the video). It’ll start out stiff and dense, but soften as you go. The goal? A smooth, supple dough that gently springs back when poked.\nShape it into a ball, wrap tightly, and let it rest again for 30 minutes at room temperature.\nWant to speed things up? You can make the dough in a food processor or stand mixer. See the recipe card at the end of this post for detailed instructions.\n\nFlattened pasta dough into an oval shaped disc\nFlattened pasta disc\nRolled pasta sheet\nRolled pasta sheet\nRolled pasta sheet\nRolled pasta sheet (con’t)\nRolled pasta sheet\nFinished rolled pasta sheet\nRolled, silky, fresh pasta sheet\nStep #2: Roll Fresh Pasta Sheets\nDust your work surface, sheet pan, and pasta machine with semolina flour.\nCut the dough into 4 equal pieces and keep the extras covered. Flatten one piece into an oval disc.\nSend it through the roller on the lowest/widest setting (#1 on the Kitchen Aid attachment). Now, send it through again for a smoother finish.\nContinue rolling it through settings #2-4 (2x on each setting) for fettuccine, pappardelle and tagliatelle. Go up to #5 if you’re making ravioli. The pasta sheet is ready when it’s slightly translucent and you can see your hand underneath.\nFold the finished pasta sheet in half, lay it on your sheet pan, and cover. Repeat with the remaining dough.\nTip: Why Semolina Flour? It absorbs less moisture than regular flour and helps to prevent sticking. Rice flour works too. My surface is always covered in a blanket of semolina flour while I work!\n\nFresh pasta sheets folded in half on a flour dusted sheet pan.\nFresh homemade fettuccine pasta coming through the Kitchen Aid stand mixer pasta attachment.\nStep #3: Cut Sheets Into Pasta\nBefore cutting: I like to semi-dry the pasta sheets for 5–15 minutes by hanging them over a chair, rod or on a hanger. This gives the strands a leathery feel (not too soft or doughy) and helps to prevent the pasta strands from sticking together later on.\nTake a pasta sheet and cut in half. Send it through the cutter attachment. Dust the strands well with semolina, then form into nests or lay flat on a tray. Repeat the cutting process for the remaining pasta sheets.\nFresh pasta (coiled nests) on a sheet pan\nHow to Store, Freeze & Cook Fresh Pasta\nTo store: Keep well-floured pasta on a tray, covered with plastic wrap, inverted sheet pan or in an airtight container. Leave at room temperature if cooking within 1–2 hours, or refrigerate for up to 12.\nI recommend cooking it the same day to avoid discoloration or sticking, if chilled past 24 hrs.\n\nTo freeze: Let pasta air-dry (uncovered) for 15–20 minutes first to prevent sticking. Then portion into zip-top bags and freeze for up to 1 month. Cook straight from frozen; no need to defrost.\n\nTo cook: Add pasta to generously salted boiling water.\nCook time ranges from 2–7 minutes depending on thickness and shape. Taste as you go. It should be al dente (soft but with a bite). Use tongs to lift the pasta directly into your sauce.\n\nJar of homemade tomato sauce made with fresh tomatoes.\nSauce Pairings for Fresh Pasta\nRagù Bolognese Sauce\nAuthentic Pomodoro Sauce (Fresh or Canned)\nClassic Italian Basil Pesto (Pesto alla Genovese)\nWhat’s Next?\nBeginner’s Guide to Fresh Homemade Ravioli\nBeginner’s Guide to Fresh Homemade Lasagna Noodles\nBest Sourdough Pasta (1 Hour or Overnight)\nSubscribe to get the latest\nfree goodies straight to your inbox\n\nE-Mail Address\n \nLong homemade fettuccini pasta noodles\nBeginner’s Guide To Fresh Homemade Pasta\n5 Stars\n4 Stars\n3 Stars\n2 Stars\n1 Star\n5 from 32 reviews\nAuthor: Emilie Raffa  Prep Time: 1 hour  Total Time: 1 hour  Yield: Serves 4  Category: Homemade Pasta  Method: Handmade  Cuisine: Italian  Diet: Vegetarian\n Print Recipe\n Pin Recipe\nDescription\nThis easy, step-by-step fresh pasta recipe will teach you how to make soft, silky homemade pasta in 1 hour (with or without a machine). It’s an all purpose pasta dough: use it to make homemade fettuccine, pappardelle, homemade ravioli and more. \n\nFor timing, the process is broken up into 3 parts: making the dough, rolling the dough into pasta sheets, and cutting the pasta into noodles. Tips shared below for using a Kitchen Aid Stand Mixer, food processor and doing it by hand.\n\nIngredients\n300 g Italian Tipo 00 Flour  (I recommend Molino Grassi or Caputo)\n3 large eggs (see note below)\n1 large egg yolk\nSemolina flour, for dusting (rice flour can be used)\n*Note: the total combined weight for the eggs & yolk (cracked) should be 185 g. Because eggs size will vary, make up the difference, if needed, with an extra egg yolk or olive oil. Olive oil makes the dough more soft, supple and satisfying to work with. \n\nPasta Equipment (choose one)\nKitchen Aid Stand Mixer (w/ pasta attachments)\nPasta Machine\nTips:\nMake space. You’ll need a long, clutter-free work surface to handle the dough. The kitchen table or kitchen island is perfect.\nWeigh your ingredients (including the eggs). This will ensure the correct texture of the dough. If your eggs are too small, the dough will be dry and crumbly.\nWrap it up. Pasta dough can dry out quickly. Keep it covered with wrap or a kitchen towel.\nCook Mode Prevent your screen from going dark\nInstructions\nStep #1: Make The Dough\nThe Traditional Way (by hand):\n\nAdd the flour to a large bowl. Make a well in the center; add the eggs and yolk.\nWhisk together with a fork, and then combine with the flour. When the texture becomes stiff, finish by hand to form a rough dough. If dry bits of flour remain after a few minutes of mixing (be patient, it’s a dry dough) add a few drops of water or olive oil to bring the dough together. \nForm the dough into a ball, cover with an upturned bowl or with plastic wrap, and let rest at room temperature for 10-15 minutes- it will be easier to knead.\nKnead the dough for 5-7 minutes. Do this by folding the dough over itself, pushing it forward with the heel of your hand, turning slightly as you go. I literally rock the dough back and forth (watch the video). The texture will be very stiff at first- it’s not bread dough. But rest assured, by the 2 minute mark it will start to soften. Keep kneading until the dough is soft, malleable and has a talcum-like finish. It should “bounce back” slowly when poked.\nForm the dough into a ball, cover tightly with plastic wrap, and rest at room temperature for 30 minutes.\nStand Mixer Instructions:\n\nFit the machine with the dough hook. Add the flour and eggs to the bowl. Mix until combined. Knead on speed #1 or #2, about 4-5 minutes. Form the dough into a ball, cover tightly with plastic wrap, and rest at room temperature for 30 minutes.\n\nFood Processor Instructions:\n\nAdd the flour and eggs to the bowl. Pulse several times until the dough comes together. Remove the dough to your work surface and let rest for 1 minute. If the dough is a bit sticky after resting, add a sprinkle of flour. Knead by hand for 1-2 minutes (the food processor does most of the kneading for you). Form the dough into a ball, cover tightly with plastic wrap, and rest at room temperature for 30 minutes.\n\nStep #2: Roll The Dough Into Pasta Sheets\nSet up your station: Dust your work surface with semolina flour. Dust a sheet pan with semolina flour (your pasta sheets will land here). Fit the stand mixer with the roller attachment. Grab a kitchen towel. You’re ready to roll.\n\nOn your work surface, cut the pasta dough into 4 pieces. Working with one piece at a time, flatten the dough into a 6-8inch oval patty. Keep the remaining doughs covered in wrap otherwise they will dry out. \nSet the pasta roller to #1 which is the lowest/widest setting on the Kitchen Aid. With the machine running, send the dough through the roller. Now, send it through again (so, 2x total). Note: if you are using a hand crank pasta machine, refer to the manufacture’s specific instructions for rolling the dough- the settings might differ but the process is the same.\nContinue to roll the dough through settings #2-4, (2x) on each setting. Do not pull on the sheet as it comes through the roller; just guide it along gently. If at any point the dough becomes sticky, dust with semolina flour. I keep my work surface dusted with semolina at all times. This way I can coat both sides of my pasta sheet easily and quickly while I work.\nYour pasta sheet is ready when it’s beautifully thin and somewhat translucent (you should be able to see your hand underneath). Don’t worry if the ends are not perfectly straight; you can always trim them with a knife.\nTo finish, dust the pasta sheet generously with semolina, fold it in half, and place onto your floured sheet pan. Cover with a kitchen towel. Repeat the rolling process for the remaining 3 doughs.\nStep #3: Cut The Pasta \nBefore cutting, I like to dry my pasta sheets ever so slightly. This firms up the final texture giving the strands a more “leathery” finish, rather than a soft and doughy feel (this will prevent the pasta from sticking together later on). \nTo Dry: Hang the pasta sheets over the back of a chair for about 10-15 minutes or so. Keep your eye on the time; you don’t want the sheets to dry out completely. You will be able to feel the difference.\nTo Cut: take a pasta sheet and cut it in half. Trim the ends, if you like. Run the sheet through your desired pasta cutter attachment to create strands. Alternatively, cut the dough by hand.\nTo Store: Heavily dust the pasta strands with flour. Coil around your hand or arrange loosely on a tray. Cover with plastic wrap and hold at room temperature if cooking within 1-2 hours. Alternatively, store in the fridge for up to 12 hrs. checking occasionally, to make sure the strands are not sticking. Note: Pasta left in the fridge past 24 hrs might oxidize, discolor and/or stick together.\n\nTo Freeze: Allow the pasta to air-dry, uncovered, for 15-20 minutes before freezing. The helps to prevent sticking. Portion into ziptop bags, remove the air, and freeze, up to 1 month. Cook directly from frozen, no need to defrost first.\n\nDid you make this recipe?\nTag @theclevercarrot on Instagram and hashtag it #theclevercarrot\n\nFiled Under: Homemade Pasta",
  "filename": "blog_how_to_make_pasta.txt",
  "information_depth": 4,
  "attention_quality": 4,
  "value_per_minute": 3,
  "novelty_index": 0,
  "spam_score": 0,
  "perspective_awareness": 0,
  "polarity_potential": 0,
  "channel_diversity": null,
  "overall_score": 2.6
}