{
  "domain": "health",
  "description": "00:00:00\tThis is exactly what I would do if I only had three weeks to get rid of my visceral fat. The stepby-step, no BS way. Matter of fact, let's kill two birds with one stone and lose both the visceral fat and the subcutaneous fat....",
  "full_text": "00:00:00\tThis is exactly what I would do if I only had three weeks to get rid of my visceral fat. The stepby-step, no BS way. Matter of fact, let's kill two birds with one stone and lose both the visceral fat and the subcutaneous fat. So, let's get the disclaimer out the way. Simple in theory, but it will be challenging to execute and this will not be sustainable long term. We will need to adjust. So, this is what I call my when all else fails contingency method. And we're going to tackle the visceral fat from both sides. on the right side\n\n00:00:29\tto stop the gain and on the left side to kill the fat. My name is Michael Diamonds. I am a medical doctor, a pro-natural bodybuilder and a scientist. And in 2025, we looked under the hoods of all of my clients. We did bloods, we did DEXA scans, MRIs, and this strategy worked every single time. So, do this right and you might even have the bonus of getting to see your abs for the first time. Let's not waste time and dive straight in. I'm actually going to start with the hardest step. The two main fat\n\n00:00:58\tstorage locations for the body is the subcutaneous fat and the visceral fat. With subcutaneous fat, it's all around the body. You can pinch and grab it. And if you have a lot of it, it's usually around your belly, your hips, and your legs. Visceral means having to do with organs, especially those in the abdominal cavity. And this is why it's called a silent killer. It can't be pinched. It's stored around several organs, including your heart, your liver, your pancreas, and intestines. Now, imagine having this thick toxic\n\n00:01:26\tsludge over all of your vital organs. And this is what makes it so dangerous. So, number one is inflammation. So, I want you to imagine this. Your knees are swollen or they're inflamed. You're limping. It's hard to walk and to get around. Visceral fat does the same thing, but to your organs. Visceral fat releases a chemical called cytoines, and they trigger inflammation throughout the body. So imagine all of your organs becoming inflamed because of this fat, not allowing the organs to do its job\n\n00:01:55\tproperly. This inflammation can narrow your blood vessels and raise the blood pressure and increase the risk of heart disease. It can slow down the liver's main function, which is detoxification of the blood. It can cause insulin resistance. It interferes with how your body uses insulin, making it less effective. And insulin is a storage hormone. Its job is to store sugar in the right places. But when it's not working well, you'll just store that glucose as fat. And you can see how this can become a vicious cycle. The sugar\n\n00:02:25\tstays in the blood. This leads to high blood sugar levels, high insulin, high blood sugar storage, and also type 2 diabetes. The inflammation and the metabolic changes caused by visceral fat are linked to serious conditions including a stroke, Alzheimer's, and even cancer. It can throw off the hormones that regulate your appetite, regulate your fat storage and energy, making it harder for you to manage your weight overall. The point I want to make is that it is an active threat. Even if you're skinny on the outside, you can\n\n00:02:55\tstill have visceral fat on the inside. This can be disrupting your body's systems and significantly increasing the risk of a life-threatening disease. So, here's how we're going to get rid of it. The first step is we want to kill visceral fat from the inside. And the saying is always losing fat is 80% of the diet and 20% exercise which is true in this case. Let's not waste time and I'm going to give you the 80% first. I'm going to tell you exactly what to eat and I call this the gut fire protocol.\n\n00:03:24\tRemember when I was describing insulin as a fat storage hormone. The smart way to lose visceral fat is to control insulin. So number one, we don't want to unnecessarily spike it and we want to keep it low as possible with the foods that we eat. So rule number one in the gut fire protocol, no ultrarocessed foods. And I want you to picture this. You're about to take a snack break. In one hand, you have a crispy juicy apple and in the other hand you have a few Haribo gummy candies and they both have\n\n00:03:55\tsugar, right? But here's the deal. They're not the same when it comes to your gut. And let me take you through what happens exactly. So, we'll start with the apple. When you take a bite into it, you're getting more than just the sugar. The apple is packed with fiber and vitamins and natural goodness. It takes a few chews to break down. Your jaw is working. Your saliva starts kicking in. And that's just the start. Once it hits your stomach, the fiber slows things down. Your body has to work to break down the apples natural sugars,\n\n00:04:25\twhich means they're released into your bloodstream slowly. That fiber also feeds the good gut bacteria, helping them thrive. Plus, it keeps you feeling fuller for longer, so you're not reaching for another snack five minutes later. It's like a slow, steady fuel for your body. Now, let's talk about the herios. Pop three gummies in your mouth and they're gone in two chews. They're soft, sugary, and they slow down really easily. Why? Because heros are ultrarocessed. All the processing your body is supposed to do happens in the\n\n00:04:56\tlabs where they're made. And this is basically the difference between whole foods and ultrarocessed. They're basically sugar in its simplest form, stripped from fiber, stripped from all the nutrients or anything that makes your gut work for it. By the time they hit your stomach, there's no real breakdown needed. That sugar spikes your blood sugar fast and consequently insulin spike, giving you a quick energy hit and then followed by a crash for you to crave more. What's worse about the heribos is that there's no fiber to feed\n\n00:05:24\tyour gut bacteria or keeping things moving smoothly. So, here's what will help us do the opposite, which is rule number two is eat gut fire foods. And why I've called it gut fires for two reasons. Number one, these foods will be high protein. And it shows that high protein foods burns more calories compared to carbs and fats. To be specific, protein's thermic effect of food, which is the sexy way of saying how many calories is burnt breaking the food down, is roughly two to six times more than that of carbs and 6 to 10\n\n00:05:56\ttimes more of that of fats. So, I'm going to give you a list of gut fire foods that you can include into your plan. And I'm even going to give you a meal plan. So, here's the list. Number one is Greek yogurt. We want them plain and we want it unsweetened. It's packed with probiotics to boost your good gut bacteria and it's high protein. Another option is kefir like yogurt but drinkable with more diverse probiotics. This is living bacteria that is good for your gut. Sauerkraut. It's fermented cabbage and it's going to strengthen\n\n00:06:25\tyour gut bacteria and it's also going to aid in digestion. Kimchi, it's a spicy fermented veggie that fights off inflammation and can add flavor. berries. I'm talking blueberries, blackberries, raspberries, strawberries. High in fiber and polyphenols, which is amazing for gut and getting rid of visceral fat, which feeds the good bacteria and also acts as an antioxidant. Chia seeds, it's fiber richch, it helps with smooth digestion, and it will keep you feeling fuller for longer. Salmon, it's omega-3s reduce gut\n\n00:06:54\tinflammation and improve insulin sensitivity for fat burning. Spinach, prebiotic fiber, which will fuel your gut bacteria and keeping them happy. We can also have almonds on the list. Healthy fats, fiber to support the gut and a steady level of energy. Avocado. It has monounsaturated fats and fiber that will stabilize your blood sugar levels. As a protein source, chicken is amazing and we want the lean pasture-raised chicken. It's high protein, easy to digest, and it's also free from any gut irritating additives.\n\n00:07:25\tAnd then whole eggs and also egg whites. It's nutrient-dense and it's also packed with a lot of vitamins and minerals in the egg yolk. These foods are now the building blocks and I'm going to give you a sample meal plan that I would follow. So, meal number one would be a Greek yogurt power bowl with 50 g of protein in it. So, I want you to grab 1.5 cups of plain Greek yogurt, which has about 30 g of protein, and I want you to mix it with one scoop of your favorite protein powder, and that's going to take you to 50 g of protein.\n\n00:07:54\tAnd in there, I want you to mix in a cup of berries. And it can be any. It can be the strawberries, blueberries, or a mix, fiber, and flavor. And you can also add chia seeds. Meal number two is going to be salmon and baked potatoes. So, I want you to have 9 oz of salmon and 8 oz of baked potato. And did you know that potatoes have the highest satiety index for carbs? Meaning that potato is going to make you feel fuller for longer compared to other carbs. Then you can add leafy greens to this meal. You can\n\n00:08:23\thave kimchi or sauerkraut to the side. Meal number three is a snack that you can have. It's high protein scrambled eggs. So, this is how you make it. So, we want one whole egg so we can get some healthy fats in there, the minerals and vitamins paired with 44 fluid ounces of egg whites. And to your egg whites, to the scrambled egg, you can add spinach, tomatoes, or any veggies to make it as colorful as it can. And on the side, you can have two to three fermented pickles. Now, I have a free 21page recipe book\n\n00:08:55\tand I'm also going to send you something else and I'll tell you about it later. So, just subscribe to the newsletter. It's going to be linked in the description and I'll email those over to you immediately. But that's just the first thing that's important. But that's not all. What you eat is important, but when you eat is also extremely important, which we're going to now tackle in step number two. I call it the double fasting approach. The first day in the week, we will fast for 24 hours. And the rest of the six days in the\n\n00:09:25\tweek, I want you to do a fasting protocol. So, there's a 2020 research paper titled timerestricted eating with or without low carbohydrate diet reduces visceral fat and improves metabolic syndrome. And there's a 2023 study titled magnetic resonance study for visceral subcutaneous liver and pancreas fat changes after 12 weeks of intermittent fasting in obese patients. All of these studies saw significant improvement with overall fat loss and especially the loss of visceral fat from doing as little as 16 hours per day fast\n\n00:09:59\tand longer. So for 3 weeks, this is what I want you to do. I want you to do one 24-hour fast and six 168 fasts. So, this is what you do. Every Sunday for the next 3 weeks, you will be having a fasting day. But this is the trick. I want you to have your last meal on Sunday, 8:00 p.m. And then that will start the clock and you will break your fast only on Monday at 8:00 p.m. This way, that's your 24 hours of fasting. Eight of the 24 hours, you'll be already sleeping, making this very, very easy to\n\n00:10:32\tdo and keeping your insulin levels low. We know to burn one pound of fat, you need to be in a 3,500 caloric deficit. And we know we can achieve this through the calories in versus calories out equation. Now, because we aren't eating for 24 hours, essentially your calories in is at zero. So, all you have to do on day one is to burn a pound of fat, which is burning 3,500 calories, which I'm going to show you how to do in these next steps. So, if you've ever done a 24-hour fast, let me know in the\n\n00:11:01\tcomments. for anyone watching this video, what's your experience? Did you notice faster weight loss? Was it hard? And I think your story may inspire someone cuz it's one thing coming from me, it's one thing coming from somebody else who is not affiliated or connected to me at all. On day one, you should have burnt 1 lb of fat already because you ate zero calories and burn 3,500 calories on day one. Obviously, it's not entirely accurate where you're going to burn exactly 3,500 by measuring with devices. point I'm making is on day one\n\n00:11:32\talready you're putting yourself into a very good deficit right to get shredded and you can also choose whichever day of the week that you want to do your fast but these are some of the other benefits of fasting my client on Tina would do the same protocol every Sunday and he noticed that he got so much more work done on his fasting days he felt extremely motivated and mentally clear beyond a 24-hour fast and he also liked how his body felt He felt he said that it was so much easier to follow the diet after a\n\n00:12:05\t24-hour fast. And when I do this, I also feel mentally resilient. I have a sugar craving. I love cookies. And it's completely gone. All the cravings are gone when I've done it. So, if you do this in the beginning of a transformation as a quick big win, this is an amazing way to start with killing the visual fat. And these are some of the other benefits. Benefit number one is improved insulin levels. So, we know that when your insulin levels are high, you're not losing any fat. And its main job is a storage hormone, primarily\n\n00:12:35\ttaking glucose in the blood. And we know insulin's main job is being a storage hormone. When you fasted for 24 hours, your insulin levels will be extremely low, putting you in the best position to lose fat. Also, it improves your insulin sensitivity. Meaning, when your body has carbs introduced, insulin knows exactly what to do because it's not overworking itself. and you become more efficient, decreasing your chances of storing food as fat in the future. And personally, I love doing this with all of my clients,\n\n00:13:07\tespecially those who are pre-diabetic or type 2 diabetic, because it does drastically improve your blood sugar levels. Number two, autophagy increase, which is basically the process of your body clearing out and repairing damaged cells. And this is amazing for anti-aging and also by promoting cellular renewal and reducing the buildup of dysfunctional cellular parts. Three, it will boost your human growth hormone which plays a role in your metabolism, muscle maintenance and fat loss. Number four, it reduces\n\n00:13:38\tinflammation improving your factors such as your blood pressure and also your cholesterol levels. Number five, improved BDNF. It increases the production of brain derived neotrophic factor. It's a protein linked to improving brain function and neuroplasticity and so much more. And finally, it's amazing for your gut health. It promotes a mechanism of modulating your gut microbiota. So basically, you will flush out more bad bacteria and promote the growth of good bacteria by fasting. This will reduce\n\n00:14:10\tinflammation because you're not stressing your gut by giving it food all the time. What it will also do is strengthen the gut barrier. Again, by fasting 24 hours, you're giving your gut a chance to recover and promoting cellular repair. However, because individual responses can vary and research is still in the early stages, I highly recommend that you test it out and see what your experience is. But let's move into step number three, the cardio to burn visceral fat. So, you always hear this argument of HIT\n\n00:14:44\thighintensity interval training versus list lowintensity steadystate cardio. But why not use them both? And I like calling it formal cardio and informal cardio. Informal cardio is just walking. Formal cardio means that you're using a machine. So, what are the differences? Intensity. Highintensity interval training, as it says, is a lot more intense and can be slightly taxing on the body, but we just do a little of it so that we can extract the benefits. With walking, it's less intense and something that you can do more\n\n00:15:14\tsustainably in the long term. The duration is where you see the benefit with highintensity interval training. You can do two to three sessions per week. So maybe on a Monday, a Wednesday, and a Sunday, or you can go Friday, Saturday, Sunday over a weekend. Versus with walking, it's something that you need to do each and every single day, but it's also very easy. Now, what about the calories burned? You're running, you're burning more calories compared to walking. Now, this is the hormonal impact. With highintensity interval\n\n00:15:44\ttraining, you do get a flurry of more hormones and amazing hormones with growth hormone, epinephrine, and norepinephrine. But with walking, you can tap more into your fat stores and both of them are effective. But in my opinion, the running is less accessible compared to the walking. You can walk every day, but with the running or doing any highintensity interval training, you need to go to a specific machine. So, let me show you how to use them both. With informal cardio, which is walking, you want to be in the range of 10,000 to\n\n00:16:19\t15,000 steps. You can track it on your phone, track it on your watch. And in simple terms, the more you walk, the more visal fat you will burn per day. So wake up 1 hour early in the morning or walk in the evening. You can also buy a walking pad like I have behind me and it's probably the best investment you can make. They are between $150 to $200. So always remember 10 minutes of walking gives you a,000 steps. 30 minutes of walking gives you 3,000. Just so all you need to do is play around with the math\n\n00:16:51\tand find where you can find 5 minutes. in 10 minutes. And you don't need to do it in a big burst. You can separate it throughout the day, but the more you walk, the more visceral fat you'll burn. Now, this is an amazing hit routine. I personally love the stairmaster more. So, I'm going to give you a hit routine for the stairmaster, and I want you to use the same concept for any machine, right? So, this is what I'll call the techno gym stairmaster hit routine. This is what I do. We want to do it three\n\n00:17:18\ttimes per week, right? For a total time of 25 minutes. And the levels I'm going to describe to you is based on your fitness. So give it a go and you can play around with the levels. So this is the protocol. Number one, we want to do a warm-up. So get on the stairmaster or on the treadmill for 5 minutes. On the stairmaster, you want to get to level 5. On the treadmill, you want to get it to about an incline of, let's say, 10%. So start at a moderate pace where you can talk, but you cannot sing. And this\n\n00:17:49\twarms up your legs. It gets your heart rate up slightly. It keeps your posture upright. Engage your core. And when you're on the stairmaster, step with your whole foot. Try your best not to hold on to the railings. Number two, we're going to do this for 15 minutes. A total of four rounds of this highintensity protocol with recovery. So, this is how to do it. Alternate between 1 minute of highintensity effort and 2 minutes of recovery. So the highintensity levels increase with each round if you feel like you're ready. So\n\n00:18:20\tinterval one, one minute at level 15. And then I want you to do an active recovery for 2 minutes at level seven for example. And this is an easier pace. And that's round one. And I want you to do this four times. So level 15 for 1 minute, level seven for 2 minutes. And on the treadmill, what this would be is sprint as hard as you can for 1 minute and then walk for 2 minutes and do this four rounds. And after you have done four rounds, we want to cool down. And we want to cool down for about 5 minutes. On the stairmaster, it'll be\n\n00:18:55\tlevel five. And on the treadmill, this is putting it back to flat on the incline. So, you want to return to a moderate pace to lower your heart rate, focus on your breathing, and relaxing your muscles. So, a quick overview. warm up five minutes. Then we want to do an interval of three minutes, right, in total, which is 1 minute of sprint or one minute of high pace on the incline with a two-minute recovery. And then we want to do that for four rounds, which is 15 minutes. And then finally, you want to do a 5minute cool down. Now, you\n\n00:19:25\thave a walking protocol and a highintensity interval training protocol. And again, depending on your level of fitness, you can play around with the levels and you'll know, hey, this works for me and this doesn't. but it is an amazing feeling and this will help you with speeding up your visual fat loss in 3 weeks. Now, step number four. We've talked about insulin and how insulin and just having it spike too high is putting you in a fat storage state, especially that with visceral fat. But the second culprit in this\n\n00:19:53\tentire thing is going to be called cortisol. Cortisol is very important, not to be demonized, but we live in a world where our cortisol is chronically elevated. There's so many things in our life that is just constantly increasing our stress levels. And the way I describe cortisol is this. It's anti-testosterone. So, we know with testosterone, it helps us build muscle. It helps us burn more calories and it helps us lose fat and also gives us more energy. Cortisol is the opposite. It takes away energy. It stores fat. It\n\n00:20:24\tbreaks down muscle. We want to keep our stress levels as low as possible. So, how to do this? Simply going on a walk is very stress relieving. And if you think about it, people always say that exercising is a great stress reliever. And the real reason for that is when you meditate or when you exercise, with meditation, you're thinking about your breathing. With training, you're thinking about the weights in your hand. So just simply focusing on one thing for 10 to 15 minutes a day can be very beneficial. So going on a walk is great\n\n00:20:57\tbecause you're just really focused on the walk. People love jogs because you're just focused on the breathing. So with reducing stress, a 10 to 15 meditation is so beneficial. The app I love using is calm. There is a beginner's guide 30 days and this changed my life. And basically in that 30 days of meditation, you learn how to focus on one thing. If it's your breathing, if it's really thinking on one thought, it will bring your stress levels down. Research has also shown journaling and maybe writing gratitude\n\n00:21:29\tin a journal every day is also amazing for stress relievers. With focusing on one thing, when you're writing, you're really focusing about the words and how your hand moves on a book. So, there's so many things that will help with reducing stress. But this is the best way to counteract the chronic cortisol elevation that you're going to get. The second thing that we can do right in step four is sleep. Now, with sleep, when you're not sleeping enough, cortisol will be elevated and all the hormones in your body aren't functioning\n\n00:21:59\tadequately because you're not giving your body enough time to recover. This resulting in your increase in visceral fat because all your hormones are out of whack. So, you need to sleep and you need to do it as the priority. It doesn't sound sexy, but it will fix everything. The insulin resistance, the cortisol gain, the testosterone increase, the hunger, all of it. if you sleep more. So, this is how I want you to think of it. I don't want you to have a wake up alarm. I want you to have a go to sleep alarm and set the alarm 1 hour\n\n00:22:31\tbefore you're going to go to bed. I want your room pitch black. We need to have it as dark as possible so that you can quickly get into bed. Now, this is the protocol I tell all my clients to follow. We want to stop caffeine 10 hours before going to bed because caffeine keeps you awake. It keeps you alert. Although you've drank the coffee, it's still rolling around in your bloodstream. And this is maybe why it's taking you so long to go to bed. So 10 hours before going to bed, you want to stop taking caffeine. So if your bedtime\n\n00:22:59\tis 10:00 p.m., 12:00 midday is the hard cut off. We want to stop eating 3 hours before bed. We want to stop drinking any liquids so you don't wake up at night to go pee and disrupt your sleep 2 hours before bed. And then finally, this is a big culprit for everybody. 1 hour before bed, you want to reduce your exposure to your screens. Your screens release the same light as the one from the sun, making and tricking your brain to thinking actually you're not sleepy. The sun is still out. Stay awake, stay\n\n00:23:28\talert. But reducing your screen exposure will help the melatonin produced, which is your sleepiness hormone. Something that we send to our clients when they join is blue light blocking glasses. So, basically, it allows you to use your devices, but it blocks the blue light, which is what stops the sleepiness hormone. Brands that I've used before is Sleep ZM, uh, True Dark, or just go on Amazon and search blue light blocking glasses, but they need to be the amber ones, the amber colors. And then step\n\n00:23:55\tnumber five is resistance training. Building muscle is fantastic for the aesthetic looks, but I want you to think of your muscle as a sponge. Muscle is what absorbs your carbohydrates, right? In the form of glycogen. So the more muscle you have, the more you can absorb the carbohydrates that you put into your system, making you insulin sensitive and also just reducing your overall visceral fat. It boosts your metabolism. There is a high correlation to how much muscle is on your body and how long you're going\n\n00:24:24\tto live. So without preaching to you about resistance training, just train three times a week at bare minimum. You'll look amazing. You'll live longer. And you'll get rid of this toxic sludge on your body. And training in three weeks, you'll be surprised how much muscle you can build. And because you've stayed here, I'm also going to email you a 3-day plan, a 4-day plan, a 5-day plan, so you can just start on your muscle building journey. I want everyone watching this video to be successful. So, I'll leave the video here. Let me\n\n00:24:53\tknow again in the comments what was your experience doing a 24-hour fast or any fasting protocol and did you see improvement? You've been following my videos for a while. Share in the comments what progress you've seen because I'm telling you there's someone who's watching this for the first time who may be inspired. Now, if you want to lose your visceral fat and your belly fat and you want more detail, you want to be like, \"Hey, Mike, I want to know how to build the perfect meal plan with the exact calories and I want everything\n\n00:25:22\treally clearly laid out for me.\" The video you're seeing on the screen has accured about 1.6 million views in the past couple of months. Some have said it's the best video they've ever seen on fat loss. And I'm showing you the comments on the screen. It's not what I say. And I created it because I wanted a one-stop shop. I wanted to make fat loss accessible to everyone. So, watch this video. I'll see you guys in the next one. That's my 3-week plan to lose visual fat.",
  "filename": "fitness_content.txt",
  "information_depth": 3,
  "attention_quality": 1,
  "value_per_minute": 3,
  "novelty_index": 1,
  "spam_score": 3,
  "perspective_awareness": 0,
  "polarity_potential": 0,
  "channel_diversity": null,
  "overall_score": 0.85
}