{
  "domain": "entertainment",
  "description": "22 Wildly Popular Products With Over 1,000 Positive Reviews On Amazon\nYes, more popular than you in high school. Shivani Agrawal\nby Shivani Agrawal\nBuzzFeed Staff\n\n1. This pocket-sized portable speaker – Infinity Fuze Pint – with dual equalizer modes, 5 hours of playtime and voice assistant integration that has over 22,000 reviews – ₹899\n\namazon.in\nGet it here....",
  "full_text": "22 Wildly Popular Products With Over 1,000 Positive Reviews On Amazon\nYes, more popular than you in high school.\n\nShivani Agrawal\nby Shivani Agrawal\nBuzzFeed Staff\n\n1. This pocket-sized portable speaker – Infinity Fuze Pint – with dual equalizer modes, 5 hours of playtime and voice assistant integration that has over 22,000 reviews – ₹899\n\namazon.in\nGet it here.\n\nAvailabe in other colours.\n\n2. This JBL Go Bluetooth speaker available in the most amazing candy colours, that you can trust with your eyes shut as if the staggering 1 lakh + reviews aren't enough – ₹1,699\n\namazon.in\nGet it here.\n\n3. These stylish hawk-inspired earphones from boAt with an HD microphone, one-button function to play, pause or forward audio and 2-lakh trusted reviews – ₹397\n\namazon.in\nGet them here.\n\nAvailable in other colours.\n\n4. This 5-way headphone splitter that will make sure everyone can enjoy the best audio quality and not worry about sharing earphones *shivers* or getting all into someone's personal space – ₹499\n\namazon.in\nGet it here.\n\n5. This Wipro WiFi-enabled smart bulb that is compatible with Alexa and Google Assistant and can light up in over 16 million colours – ₹749\n\namazon.in\nGet it here.\n\n6. This wireless charging pad is compatible with both Apple and Android phones and will make sure that all the chargers in the house don't get passed around like shared property. Over 1 lakh people love it! – ₹1,499\nA person placing their phone on the charging pad\n\namazon.in\nGet it here.\n\n7. This French Press coffee-maker with a 4-step filtration system that will give you the best brew in just under 4 minutes – ₹1,599\n\nA collage showing how to use the French Press\namazon.in\nGet it here.\n\n8. This infuser water bottle with a sipper lid and hydrogel ball infuser that actually adds taste to your water! You can use it to infuse fruits or even to make a cold brew – ₹999\n\namazon.in\nGet it here.\n\nAvailable in other colours.\n\n9. This best-selling chopper that helps you chop veggies and grind soft spices and nuts has over 64,000 reviews and a 4.3⭐-rating – ₹517\nA person pulling on the string of the chopper\nFinely chopped onions\nGround peanuts\nShreya Mali\nGet it here.\n\n10. The Fujifilm Instax Mini 9 that is possibly the best and most affordable Polaroid camera right now and 3,900+ reviewers vouch for it – ₹3,999\n\nShivani Agrawal\nGet it here.\n\n11. This Apple Cider facewash from WOW that comes with an attached silicone brush for ease of application and cleaning that over 24,000 people on Amazon really really love – ₹359\n\namazon.in\nGet it here.\n\n12. This Blur Perfect primer from Lakme that blurs pores and softens blemishes, giving you the perfect base to apply makeup on. You can also just use it with your moisturiser regularly for a soft, radiant glow – ₹503\n\nA before and after image of a person wearing the primer\namazon.in\nGet it here.\n\n13. This Vitamin C face serum with turmeric that keeps your skin radiant and reduces hyperpigmentation, dark spots and acne scars – ₹538\n\namazon.in\nGet it here.\n\n14. This deep-cleansing charcoal mask that unclogs pores, gets rid of dust and excess oil, and leaves your skin feeling baby soft. Over 22,000 people LOVE it – ₹199\n\namazon.in\nGet it here.\n\n15. This best-selling kit of Red Onion Black Seed oil, shampoo and conditioner is an easy three-step remedy to significantly lessen hair fall and increase volume and strength – ₹969\n\namazon.in\nGet it here.\n\n16. This zigzag corner shelf that gives you ample surface space and will fit into any little nook of your home – ₹999\n\namazon.in\nGet it here.\n\n17. This marble-textured contact sheet that will stick to almost all smooth surfaces and can be used to upcycle old, scratched up furniture or to give your home a quick and budget makeover – ₹249\n\n\namazon.in\nGet it here.\n\n18. This super subtle laundry basket that is completely covered but also has tiny air vents so your dirty laundry isn't just out for everyone to see while still remaining odour-free – ₹1,058\n\namazon.in\nGet it here.\n\n19. These drawer organisers increase space tenfold and actually create designated spots for different items instead of it being just one big messy drawer full of things – ₹719\n\namazon.in\nGet it here.\n\n20. There is nothing these silicone gloves cannot do. Use them to wash dishes, bathe your pet, clean tiles and even to clean vegetables – ₹299\nA person using the silicone gloves to wash an apple\nA person using the silicone gloves to wash the dishes\namazon.in\nGet them here.\n\n21. These genius 5-layer hangers (set of 6) so you can fit more clothes in less wardrobe space – ₹369\n\namazon.in\nGet them here.\n\n22. And this pack of Command Strips that will help you stick almost anything on a wall, including shelves, without any nailing or drilling. And they don't even leave any adhesive residue behind! I have 5,000 reviews that prove it! – ₹199\n\namazon.in\nGet it here.\n\nTrending on BuzzFeed\n1\nCulture\nFormerly “Gifted” Kids Are Sharing What They’re Like As Adults, And The Burnout Is Very Real\n2\nGoodful\nDoctors And Scientists Are Revealing Things People Don't Realize Are Wildly Bad For Their Health\n3\nCulture\nWomen Are Sharing The Tips And Hacks All Women Who Live Alone Need To Know, So Please Pay Close Attention\n4\nCulture\nHere's How Donald Trump Responded To Elon Musk's Twitter Meltdown, And It's EXACTLY What We All Saw Coming\n5\nCulture\nPeople Who Slept With Their Friend's Mom Are Sharing Their Stories, And I Gasped At Each One\n6\nCulture\n19 Things That Are Way, Way, Way, Way, Way Larger Than They Should Be\n7\nCulture\nElon Musk's Latest Tweet Storm Is Surely Going To Piss Donald Trump Off\n8\nCulture\n17 Facts About US History That Will Remind You Things Aren't Uniquely Horrific Now — They've Always Been Terrible\n9\nCelebrity\nDanny DeVito And Arnold Schwarzenegger Were Caught Gossiping About Colin Farrell’s Outfit, And I’m Literally Obsessed\n10\nCulture\n\"This Sh—t Affects People's Lives\": People Are Absolutely Fed Up After Marjorie Taylor Greene Admitted She Didn't Fully Read The Bill She Voted Yes On\n",
  "filename": "product_review_blog.txt",
  "information_depth": -1,
  "attention_quality": -1,
  "value_per_minute": 1,
  "novelty_index": -3,
  "spam_score": 4,
  "perspective_awareness": 0,
  "polarity_potential": 0,
  "channel_diversity": null,
  "overall_score": -1.95
}