{
  "domain": "health",
  "description": "00:00:00\nToday, I’m going to show you what no other company wants to show you — our manufacturing facility where we’ll make India’s cleanest protein. You’re trusting me with the food you’ll put into your body. The least I can do is show you where it comes from....",
  "full_text": "00:00:00\nToday, I’m going to show you what no other company wants to show you — our manufacturing facility where we’ll make India’s cleanest protein. You’re trusting me with the food you’ll put into your body. The least I can do is show you where it comes from.\nThe air here is so purified, even a brand like Johnson wouldn’t want to leave.\n\nAlright guys, I’m quite nervous. I’m finally signing an agreement.\nThis is Dr. Singh. He has 25 years of experience in R&D and testing, and he has over 10 patents to his name. He’s going to be showing us our manufacturing facility. Let’s begin.\n\n00:00:38\nThe first thing Dr. Singh told me is that before entering the R&D lab, there are two special doors that never open at the same time. Look, there are two doors — this is the first, and this is the second. So if we open this door while the first one is still open, no matter how much we try, this door won’t open. Because we’re making every effort to ensure that outside air pollution doesn’t enter our manufacturing facility and contaminate our products.\n\n00:01:12\nSo Dr. Singh, this facility looks great. But can you tell me the difference between this facility and any other regular one?\nSure, Rivan. I think this is a state-of-the-art facility, and it’s a dedicated nutraceutical facility. We have more than 150 scientists working here, and this center is also approved by DSIR. This Department of Scientific and Industrial Research is governed by the Government of India and is granted to companies with high-quality R&D.\n\nWe have the product development lab on this side.\nYes. So now you have to wear this.\nBefore entering the product development lab, we wore gloves, a lab coat, and shoe covers. Then we saw the shifting machine — just like rice is filtered using a sieve, this machine has a large sieve to filter out impurities. It also has a big magnet to remove iron particles.\n\n00:02:27\nAfter the shifting process, the protein is blended using a ribbon blender machine.\nHere, if you see, we have a ribbon blender here. So this is one of the ribbon blenders used to make protein powder.\n\nSo Doctor, can you show us how this machine works?\nSure. Can you see the movement of the ribbon blender?\nYes.\nSo this movement keeps blending the powder in a very uniform manner.\nOkay.\nTo ensure a uniform taste.\nExactly — so all the ingredients mix uniformly.\nThis is just a small ribbon blender used in research and product development, but actual manufacturing uses a much larger ribbon blender.\n\nCan I test it now?\nOf course, but for that, you’ll need to go to the sensory lab.\n\n00:03:01\nHere is our sensory lab. So Rivan, this is our sensory lab. If you want to taste any of these products, it’s really good. This is what real ingredients taste like — no artificial chocolate flavor.\n\nThen we left that building and went to another facility.\nOne interesting thing about this plant: the photos here are of the factory workers’ own children. These are not random stock images from Google — these are their own kids. So you’ll see many more photos on the staircase as well.\n\n00:03:40\nLike that one. All the pictures are of the workers’ children.\nEveryone makes protein, but a few things in this plant really impressed me.\n\nFirst, all the walls have rounded edges. If you notice, all walls across the factory have rounded edges to prevent dust accumulation. If the edges weren’t rounded, dust would accumulate. So the floor and wall design prevents that.\n\n00:04:14\nSecond, they use purified water to clean the equipment. Usually, brands clean equipment with normal ground water, but here, they ensure all cleaning uses filtered water so there’s no chance of product contamination.\n\nThird, the HVAC system purifies outside air. This is the HVAC system — it purifies the contaminated outside air. The air here is so purified, even a brand like Johnson wouldn’t want to leave.\n\nThey do a lot of protein testing here, which I’ll show in part two. But for now, the main highlight is the agreement signing.\n\n00:05:21\nAlright guys, I’m very nervous. I’m finally signing an agreement to lock in our manufacturing plant where our clean protein will be made. I’ve seen the entire facility in detail and I’m really happy. I’m confident there won’t be adulteration or amino spiking.\n\nSo I’m very, very happy and nervous at the same time. This is a major step in our lives. Finally excited to sign this agreement to lock in our manufacturing facility.",
  "filename": "youtube_transcript_foodfarmer.txt",
  "information_depth": 2,
  "attention_quality": 3,
  "value_per_minute": 3,
  "novelty_index": 3,
  "spam_score": -3,
  "perspective_awareness": 0,
  "polarity_potential": 0,
  "channel_diversity": null,
  "overall_score": 3.2
}