{
  "domain": "finance",
  "description": "00:00:00\tSo, I want to make something very, very clear to you. There is no such thing as get-rich quick. There's no such thing as get-rich easy....",
  "full_text": "00:00:00\tSo, I want to make something very, very clear to you. There is no such thing as get-rich quick. There's no such thing as get-rich easy. But there is such a thing as get-rich quicker and get rich easier. So, whatever you do in life, you're not just going to magically snap your fingers and all of a sudden make money. But there are definitely ways that you can make your life a lot easier because their quote unquote laziness leads them to evaluate all the opportunities and choose the opportunity that has the best\n\n00:00:23\tROI, the best vehicle to get them to their destination. So, in today's video, I have a very simple promise for you. I'm going to show you the laziest way. And by the way, don't ever let anyone shame you for looking for the laziest way. A lot of times the laziest translates into the smartest. So, I'm going to show you the laziest way to make money this year. And we're going to do that by evaluating all the different business models out there and get to the bottom of really what makes the most sense for you at your career\n\n00:00:44\tstage. All right. So, listen. As a ninefigure entrepreneur, I've been asked this question over and over and a lot of people I come from a very unique perspective because I own multiple software companies. I own multiple physical product brands. For example, like my eyewear business. I got my start doing service businesses. I've been one of the most successful people in digital products probably ever. And at least at this current time, I'm the number one digital product expert in the world. And as I said, going back to my software\n\n00:01:07\tcompanies, one of the companies that I own is a company that helps people with digital products. And at the time of recording this at least, people make about $100 million a month on my platform. So, I'm in this very interesting position where, you know, I've had service businesses, I have some bootstrap software companies, I have some VC funded software companies, I have physical product brands, I have consumable brands. Like, my investment, my empire is so far reaching. So, I'm not really married or obsessed over any\n\n00:01:29\tone model. They can all work. I'm just trying to be honest with you guys and show you which one is really the laziest one, aka the smartest path. So that way, you're not working 60, 70 hours a week on this thing that may or may not work. So, that's why in today's video, we're going to answer a very simple question. How can you make the most amount of money with the least amount of effort? You see, in 2025, there's this whole stigma, you know, there's this whole uh grind culture where anyone asking this\n\n00:01:49\tquestion should be shunned for wanting to make money with minimal effort. And as someone who has taught thousands and thousands and thousands of aspiring entrepreneurs how to make money online, to be honest, at this point it might even be millions. I want to tell you something very important. Asking what is the laziest, which to me really just means the smartest, the highest ROI way in terms of how much you put in versus how much you get out. Like as an investor, for example, I'm always looking at deals and I'm going, how can\n\n00:02:13\tI make the highest return, have the largest delta from what I put in compared to what I get out? Why should business be any different or side hustles or online businesses be any different? Like it's a very valid question to ask and you should not be shamed for wanting to be a bajillionaire and you know work your face off for 30 years and you know sleep on a mattress. It's like no your business can work for you and you can build a lazy business that works for you rather than you being a slave to business. So this is a very\n\n00:02:34\tvalid question. Don't let anyone the whole hustle hustle culture thing like try to shame you for asking this question. And listen, I'm sure you've seen this and I'm sure you're sick of it. You know how many videos have you seen on YouTube telling you the reason that you're not a millionaire is because you're just simply not working hard enough? Okay, cool. So, using that same logic, is that the reason why nurses, teachers, and construction workers aren't millionaires because they just don't work hard enough? Of course not.\n\n00:02:55\tWe know that's ridiculous. Those are some of the hardest working professionals out there. You see, hard work is just one component of becoming rich. And the richest people on earth, they know this. They understand this. As Warren Buffett once famously said, it's not about how hard you row, it's about what boat that you're in. So, in very simple terms, the business model you choose is more important than the hours you dedicate to it. Some business models require more work than others to achieve the same result. That is quite frankly a\n\n00:03:19\tfact. So today I'm going to help you find the laziest business model. I'm going to compare five different business models. And by the way, this is speaking from experience. Not a, hey, well, I think this one's harder. I think this like, by the way, coming from someone who's made a million dollars in profit with every single one of these models. Literally every single one of them. And some of these models I've made up to $100 million from. So like, trust me, I know what I'm talking about when I speak\n\n00:03:40\tabout this. and we're going to compare them to find the one that allows you to make the most money with the least effort. So to compare these business models, let's use five categories to accurately assess which business model is truly the laziest. The first one is upfront capital. Now the capital category measures the minimum dollar amount you need to spend to start the business and get it off the ground. Next is scalability. Now scalability measures your ability to make more money without doing additional work. Next we look at\n\n00:04:08\tfulfillment. Now, fulfillment measures how challenging it is to deliver whatever it is that you're selling. Next, we look at risk. Now, different business models have various levels of risk. Risk is usually linked to time and capital. And by the way, I am not a fan at all of risk when it comes to starting a business. Now, later on in your life, you can take big bets. A lot of times when I start companies or, you know, even my existing businesses, the other day, we sent a half million dollar wire\n\n00:04:32\tfor our next batch of product for the eyewear company. Or for example, when I started Big Day, my consumable brand, we put almost a million dollars into stock just from the get-go. And as time goes on, you can put more risks into these businesses. These days, I'm taking very, very big risks in terms of my capital, in terms of how much money I'm investing in businesses. That's really what I've been doing majority of last year in my free time is just buying up a lot of companies. And usually each month I\n\n00:04:53\treveal one of those. I'm sure some of you guys saw I took a major stake in a company called WAP as a coowner. Whether it be that or another one of my companies, LRA, that I invested in last year. I'm currently a shareholder in that company. We just got accepted into Y Combinator and in a few months when we open up our first official round, I would have made about a 15x in that company. So all of these are great, but they're risks. They're big money risk. A lot of times these risks cannot work out. So me in my career stage, you know,\n\n00:05:15\tif I write the checks that I do and things don't work out, if I invest money into this company or that company, it's okay because I have the risk tolerance and I'm farther into my career. Whereas when I first started, I'm really not a big fan of risk until you've had many, many years under your belt as an entrepreneur. Next is difficulty. Now, difficulty measures how hard it is to understand the business model and how much trial and error is involved in building a successful business. So, to truly find the laziest business model,\n\n00:05:40\twe really need to start by finding the business model that meets these following criteria. Upfront capital is low, scalability is high, fulfillment is easy, risk is low, and difficulty is easy. If we can get one that has all of these, well, then amazing. We are in business. Now listen, I know there are thousands of entrepreneurs out there telling you how easy it is to make money with the model that they use. As I mentioned to you before, there's one very key difference between them and me. The reason that these people tell you\n\n00:06:09\tthat their business model is the easiest is because that is the model that they succeeded in. I have succeeded in all of these models either previously or currently still in this moment. So, that is why you truly came to the right place with this video because I have a full 360 view of all of them and I truly understand which business models you can make the most amount of money with with the least effort. So, as I said, today I'm going to share behind the scenes of some of the most popular online business\n\n00:06:34\tmodels. As I mentioned, no one is more qualified to share this on YouTube because I've succeeded with all these, whether that be consumable brands, software, digital products, agency services, once again, physical products, and with most of these businesses, I have multiple companies within those product categories. So, let's start with one of the most common online business models, drop shipping. I mean, drop shipping seems pretty easy, right? You just find a product that people like, you find a supplier from a country like\n\n00:06:56\tChina. You list a product on your website, and the sales start rolling in. Voila. Surely. And the best part is that all of the fulfillment is taken care of by your supplier. Well, my friend, I wish it was this easy, but unfortunately, it's not. So, let's see how drop shipping stacks up in our five categories. Starting with upfront capital. You see, one of the most expensive parts when it comes to starting a drop shipping business is finding a winning product or at least a legal one. Anyways, that usually\n\n00:07:22\trequires weeks if not months of running paid ads just to see whether you have found a product that actually sells. Then when it comes to scalability, I mean to be honest, it really depends. Traditional drop shipping isn't scalable at all. Drop shippers continue to test products, always closing old stores that are dying and building new stores for the next fad or the next product that they find that's a winner, but then fades over time. So, if you're building real actual brands like I do with my\n\n00:07:46\te-commerce products, then yeah, sure, it can be very scalable. But then again, I say that and there's issues all the time. You know, even just yesterday, listen, it wasn't a massive order. It was only about a,000 units. So, those thousand units of one of our SKs at the Iowa company, whatever, that's 125 grand worth of sales or stock. So, it's a very small part of our order. But anyways, in the production, there was some discoloration for us. That's not acceptable. We're never going to sell that to our customers. So, there we go.\n\n00:08:08\tNow, I'm set back 2 to 3 months on that specific skew. So it is scalable but you can you know anytime you're making anything tangible there can be a lot of issues involved. But anyways back to the point if we're doing it like this and you know building a real brand and all that stuff that doesn't fall under traditional drop shipping anymore. These businesses are highly complex with multiple parties being involved along the supply chain. So building a real brand compared to drop shipping those are two very different things. Now when\n\n00:08:31\tit comes to fulfillment yes you know majority of it is done for you for the most part but there are aspects of the fulfillment process that is out of your control. aspects like shipping delays, suppliers not having stock and refunds. The lack of control when it comes to fulfillment can make this a very stressful business because you know maybe you have the demand but unfortunately a lot of times there can be fulfillment issues. So moderate I don't mean as in like it's a lot of difficult to fulfill. It's just that\n\n00:08:52\tthere's a lot of things that could go wrong in the process. Now let's talk about risk. You see the upfront investment needed for testing products fluctuating market trends and a lack of control during fulfillment means that drop shipping is a high-risisk business model. I mean, even just a few days ago, I woke up to the glorious news about Trump's new tariffs, and that makes drop shipping that much more tricky. And listen, for me as an e-commerce brand owner, that affects me personally as well. Now, I'm going to be fine. I'm\n\n00:09:14\tgoing to be good. As I said, I have actual brands. There's a lot more control we have, and there's a lot more options and ways to take things. But with drop shipping, unfortunately, things have gone that much harder. Now, going back to risk, I have seen so many beginners burn through money when they don't have the right training. And I've seen established stores die out due to market trends. Now, when it comes to difficulty, I would say this model is incredibly difficult. Okay, being truly successful with drop shipping in 2025 is\n\n00:09:36\tvery difficult. And by the way, it just seems to be getting harder and harder and harder. The amount of trial and error when testing products coupled with the levels of competition in the market means the learning curve is steep. It can take months, half a year, a year to even become profitable. So, let's summarize drop shipping. Upfront capital 2 to 5,000. Scalability is moderate. Fulfillment is moderate. Risk is high. And difficulty is hard. So, listen. Despite popular belief and all the stuff\n\n00:09:58\tthat you've been sold, drop shipping takes a lot of effort and high risk tolerance to be successful. So, let's talk about the first model that I used to make money online. Social media marketing agency. A social media marketing agency is a service-based business where you offer specific marketing services to businesses in exchange for a fee. Now, these services include services like paid traffic, SEO, web development, social media management as well as lead generation. I have openly said many times that SMMA is one\n\n00:10:24\tof the best business models for beginners, but let's see how it performs in the five categories. So, let's talk about upfront capital because this is really where SMMA excels. SMMA is a sweat equity model. It doesn't require thousands of dollars in software or paid ads to keep upfront costs low. All you need to get started is a laptop, Wi-Fi, and some basic software. It's very cheap to start. Now, one thing that SMAs aren't particularly good at is scalability. Agencies can be scaled, but it comes at a cost. Because it's a\n\n00:10:48\tservice-based business, every additional client adds more work and more complexity. And there becomes a point where agencies become so complex that simply the extra juice just isn't worth the squeeze. And that's why for so many years I kept telling people agency is a great business model to get to 10K a month. If you go look at my YouTube channel, I wasn't telling people you're going to make 100K a month, you know, any huge numbers. I just said, listen, if you want to have a great lifestyle business to make 5K, 10K, you know, 15,\n\n00:11:10\tyou know, even upwards of 20K a month, great business model. Scaling past there, you know, becomes a little tricky. Now, let's talk about fulfillment. You see, fulfilling the services you provide when running an agency can be pretty simple due to contractor arbitrage. But that is only one side of it. And by the way, contractor arbitrage just means you find someone to deliver the service in a country where the US dollar, you know, the buying power is substantially better. You pay them $500 per month per\n\n00:11:31\tclient, you charge the client $1,500 or $2,000. And by the way, like it's so funny in the past when people have argued with me about this. It's like pretty much the entire global economy works on an arbitrage model. That's why like drop shipping, for example, is an arbitrage model. So this model is like omniresent. It's like everywhere in the world. It's just with SMA you apply it to services. Now some downsides. You have to manage a full team and deal with clients on a daily basis which doesn't\n\n00:11:52\talign with our goal of finding the laziest business model. Like I would say agency is a great business model but like you learn so much as an actual business owner because you're like you have to be truly truly a business owner. Like you have to be switched on. You have to be on the ball. Risk. Once again SMA is one of the lowest risk business models out there. It's amazing because it doesn't require huge capital injections to get started and you have a lot of control over the fulfillment process. This is one of the main reasons\n\n00:12:15\twhy I have always said that SMMA is one of the most beginner-friendly business models out there. When it comes to difficulty, I give it a moderate. SMA has become a lot harder over time. There's no denying it. Obviously, as markets start to become more mature, a lot more people come into market. It does get trickier as time goes on. There's definitely more competition in the market than when I first started, and it is a business model that requires you to master various different skills such as prospecting, outreach, sales,\n\n00:12:38\tand management. You actually have to be a real business owner and be skilled in multiple different domains. So to summarize, upfront capital $50 to $200. Scalability, low fulfillment, moderate risk, low difficulty, moderate. So to summarize, SMA is a business model you can start with almost no risk. But a big drawback, especially when you're looking for a loweffort business, is that scaling often leads to complexity and increased workload. So let's talk about a big one. You see, a lot of new business owners want to start by\n\n00:13:04\tcreating the next big app. So let's break that down. Software. You see, some of the most famous entrepreneurs have made millions, even billions of dollars in software. And this leads aspiring entrepreneurs to believe that software is the best business model to get rich. And listen, I can tell you from experience that software is one of the most difficult business models to succeed in. I've built my own software company, Floy, from scratch, and I've also invested in various others. Using my experience, let me use the five\n\n00:13:30\tcategories and show you why software is not for those who want to build a business with minimal effort. So, let's talk about upfront capital. You can look at minimum $250,000 to build a solid solid software company. If you're trying to build a software company that will make you rich, you either need a lot of your own capital to invest or you need hundreds of thousands if not millions in funding. By the way, even if you already know how to code, you're going to need a team and software developers are not\n\n00:13:53\tcheap. On top of this, you will need an extensive marketing budget to get the business off the ground. Now, I will say scalability is very high. And the reason that software has created so many billionaires is because it is highly scalable. Once you have your product, it is just about getting more and more users. That being said, there are complexities that arise as you scale. Your team is going to have to grow in departments such as developers, customer support as well as client success. Fulfillment is very difficult. You know,\n\n00:14:17\tbuilding a software will take months if not years of hard work. And even after the product is built, software demands ongoing development of new features as well as ongoing bug fixes. Now, when it comes to risk, this is a real drawback to software. Very high risk. You know, software is one of the riskiest business models out there. If you're using your own capital, all of that money can be lost if the business doesn't work. And in many cases, software entrepreneurs are using money from investors, which\n\n00:14:40\tadds an extra layer of risk on top. For difficulty, it is extremely hard. The software industry is one of the most competitive markets on Earth. It also requires a huge amount of technical skills such as coding and design. It's going to require outside funding, and securing that funding makes the business model even more difficult than what it already is. So, pretty much to summarize, upfront capital, you're looking at a lot of money. Scalability, yes, it's very high. Fulfillment, hard, risk, high, difficulty, very hard. So,\n\n00:15:07\tsoftware is just simply not a beginner-friendly business model, and it takes years of effort to be successful. My honest advice would just be to avoid software when starting your entrepreneurial journey. Next, I'm going to show you a business model that I have made millions and millions of dollars with, but has always just been sort of a background side income, and that is affiliate marketing. Listen, to be honest, I wouldn't really call affiliate marketing a real business, but there are people making a lot of money using this\n\n00:15:30\tmethod. Affiliate marketers promote other brands products in a variety of ways. These include websites, blogs, social media content, and product reviews, just to name a few. You see, when someone buys a product through the affiliate marketer's link, they get a pre-agreed cut of the selling price from the brand. So, for example, when you're watching a YouTube video and the creator ends the video with buy/signup using the link in the description, when they see stuff like that, that is an affiliate\n\n00:15:52\tlink and they get a kickback from every sale. Now, let me make something very clear. I have never used my social media platforms for affiliate marketing, but some of my previous agency programs had affiliate links for different softwares that my clients needed. Okay? So, these people needed these softwares regardless. So, if I'm going to promote these softwares, I might as well drop in my affiliate link. And this was a win on both sides because I was able to make passive income from affiliates, but I\n\n00:16:15\twas also able to get favorable terms for my clients and users for software that they needed regardless. Now, being fully transparent, I don't really use affiliate marketing anymore because I now have the resources to build custom softwares for my users. So, rather than recommending softwares, I either just create my own or I just invest and buy into existing software businesses. So, that way I can control them and I can tweak them as I like. That being said, is it a method that you can use to make\n\n00:16:39\tmoney with minimal effort is a real question. Well, let's take a look. Upfront capital, probably $100 to $200. I mean, affiliate marketing requires minimal upfront investment to get started. A majority of your capital will be spent on content tools like editing software and maybe some AI tools to make the process easier. Scalability here is moderate. Affiliate marketers can promote as many products as they like. There's an endless amount of affiliate programs out there. So, the scalability constraints really comes into play when\n\n00:17:02\tit comes to actual content. It is impossible to promote hundreds of products in one piece of content, which means the more content you make, the more products you can promote and the more money you are able to make off the back of it. Now, when it comes to fulfillment, it's relatively easy because the physical product fulfillment has nothing to do with you. So in this regard, the fulfillment is actually quite simple. That being said, if you want lots of people to use your links, the content has to be quality and you\n\n00:17:24\tneed to attract a big audience. You know, affiliate marketing to me, the reason I don't consider it like a proper business is like you build a personal brand and then you can make money from affiliate marketing. So the fulfillment, yeah, you're not fulfilling on like what is being bought, but you're fulfilling in terms of like you have to create the content to draw the audience in and then from there they use your affiliate link. So as I said, you need to attract a big audience for this specific model to\n\n00:17:43\tactually work. Growing a larger audience isn't impossible, but of course it takes time and effort. I love it. I recommend everyone build a microniche personal brand. It's one of the best things that you can do for your career in life, but of course it's not something that you know, snap your fingers and it just happens overnight. When it comes to risk, obviously this is extremely low. You know, there's practically no upfront investment and growing an audience on social media will add value to your life\n\n00:18:02\twhether you're successful with affiliate marketing or not. This means the risk is pretty much insignificant. Now, when it comes to difficulty, I'd say it's moderate here. you know, actually finding affiliate links and the lack of product fulfillment makes affiliate marketing an easy method to make money with. But the aspect that increases the difficulty from easy to moderate is the fact that you need to grow an audience and this can take months of mastering content creation. So that's what takes\n\n00:18:23\tit from super easy business model to moderately difficult. So just to summarize here, upfront capital, you're looking at $100 to $200. Scalability, moderate fulfillment, moderate risk is low, difficulty is moderate. Affiliate marketing is a cheap, low-risk method to make money online. The biggest barrier for most beginners is really the time that it takes to grow an audience large enough to make a sustainable income with affiliate marketing. Now, at this point, I've broken down four of the most common\n\n00:18:48\tways to make money online. Drop shipping, SMA, software, affiliate marketing. Now, as I've shown you, some are easier than others, you know, lazier than others, but it's unlikely that you're going to be able to make a substantial amount of money with minimal effort with really any of these methods. So, just remember, I have successfully made money with literally all of these models. And now I'm going to reveal what I believe is truly the laziest business model out there for you to get started with. My friend, let me introduce you to\n\n00:19:13\tdigital products 2.0. You see, a digital product is a way of packaging information in a way that solves a particular problem for the buyer. Most commonly known as courses or programs. Now, as many of you guys know, I've done this pretty much more successfully than almost anyone else out there, coming right up to almost $und00 million in earnings in the last 5 years with this model. Now, I created my first official digital product in 2018. And since then, I've made millions from selling digital products. But I want to be very honest\n\n00:19:39\twith you. You see, when I first started with digital products, it wasn't easy to just create the most basic of digital products, it took me months. And as the quality went up, so did the cost. By the way, I'm not talking about just a few thousand. Products like Agency Navigator and Agency Accelerator had external coaches and completely custom platforms. Not to mention the size of the team I hired to help me build out the programs as well as do the service delivery. These products, I'm not joking, cost me\n\n00:20:02\tmillions of dollars to produce. Now, you very fairly might be thinking, well, if digital products are so complex and expensive to create, why am I even mentioning digital products in a video that's all about making money with minimal effort? Well, I will tell you why. It is 2025 and times have changed. You see, I got started with digital products in 2018. That was digital product 1.0 era. Right now, it's 2025 and we're living in digital product 2.0 era. You see in the past digital products had one of the highest barrier\n\n00:20:30\tof entrance because you needed extraordinary expertise months of research highle copyrightiting skills as well as expensive custom platforms. Now there have been two technological advancements that have eliminated the need for everything I just mentioned and those are artificial intelligence as well as product hosting platforms. You see every product that I've built over the last 7 years took me months to build out. The team and I needed to research the topics, synthesize the information, script videos using the synthesized\n\n00:20:58\tinformation, and only then could I sit down and actually record the program. Whereas with AI, this takes a fraction of the time. AI is able to research a topic, synthesize the knowledge, and script the content that needs to be recorded in minutes. Let that sink in. Truly, let that sink in. What took my team months takes minutes with AI. Now, by the way, I know you're hearing this and thinking, \"No, this is too hard to believe. I can't imagine something like this.\" Well, the crazy thing is that my\n\n00:21:24\tteam of developers and I have already built a tool that does exactly this. And we've only let in a small group of people earlier this year to actually use it because it's so ridiculously powerful. But I can tell you for a fact it works and it has pretty much eliminated 95% of the workload in these people's businesses. It basically helps you do 100 business plans at once and from there helps you find profitable product topics. So, it'll actually help you find the best markets to get into. And then from there, it synthesizes\n\n00:21:48\tknowledge from experts. And then from there, it creates program outlines and scripts the lessons. Literally, the only task you have is to record yourself reading the script. That's it. You don't even need to show your face because the recording is done on Loom. All you're going to do is speak over the documents that are on the screen. That's it. And by the way, Synthesize AI doesn't just find your topic. It creates the program outline for you, as well as the entire script for you. It even creates\n\n00:22:12\tsupporting PDF resources and tools for your program to make sure the product is as valuable as possible for your clients. So, as you can see, AI has truly changed the game with regards to building the product. But what about hosting and selling it? You see, in 2025, there are platforms that will not only host digital products, but will also boost sales through their built-in marketplaces. This leads to the barrier to entry being lower than ever before. So, let's take a look at an example of another industry that saw the drastic\n\n00:22:39\tlowering of barriers to entry just a few years ago. Let's go back to the example of e-commerce. You see, there was a time where if you wanted to sell physical products online, it was practically impossible for beginners. You either needed capital to invest or you needed to be able to code to create a custom website to sell your products. Then, fast forward a few years and Shopify becomes available, a platform that allowed literally anyone to sell physical products online. In addition to that, Amazon also takes off. This\n\n00:23:06\tallowed anyone to sell products on the biggest physical product marketplace on earth. So what happened to these platforms when it became accessible for everyone? Beginners started making millions of dollars using methods such as drop shipping and Amazon FBA. These platforms eliminated all the barriers to entry. This is about 10 12 years ago. Now recently, as some of you guys may have seen, I announced that I made a major investment and became a co-owner of WAP is a platform to host and sell digital products. Think about it\n\n00:23:34\tkind of like Shopify and Amazon in one platform for digital products. You see, the combination of artificial intelligence like Synthesis AI and digital product platforms like don't only provide one of the biggest online money-making opportunities of the decade. It also presents one of the easiest, laziest ways of making money online in 2025. But let's make it fair. Let's see how digital products perform in each of the five categories that we discussed earlier. Digital products 2.0 upfront capital maybe $100 to $200.\n\n00:24:04\tDigital products 2.0 requires minimal upfront investment. WAP is free to use which has eliminated the need for expensive custom platforms. And by investing into tools like Canva to create branding, Loom to record the program and AI to create the product, you're able to create a top tier product with minimal upfront investment. For scalability, it's super high. I mean, digital products are extremely scalable. You only create the product once and then you can sell it thousands of times without doing any extra work. Now when\n\n00:24:29\tit comes to fulfillment, super easy. As we discussed earlier, building a digital product business was one of the most difficult as well as timeconuming tasks a beginner business owner could undertake. But once again, the combination of platforms such as and AI tools like Synthesize has made the fulfillment process so simple. When it comes to risk, it's extremely low. The risk is insignificant for a couple of reasons. WAP is free, so you can literally launch as many digital products as you want until you find one\n\n00:24:54\tthat sells without worrying about the cost. You also don't spend months building a product anymore, which means you can build quickly and test without running the risk of wasting months of your time building a product that makes no money. Difficulty, once again, super low. I've discussed at length how easy the process of building digital products has become, but there's another reason why the difficulty level is actually extremely low. Most people don't realize this, but the industry is in its infancy, which means competition is\n\n00:25:18\tstill extremely low. Those who get in right now have the highest chance of succeeding long-term. Getting into digital products 2.0 right now is like getting into drop shipping or e-commerce 10 or 12 years ago. Like 10 or 12 years ago, this would be a very different presentation. Digital products would be super difficult. I couldn't even recommend it to you guys. And e-commerce would be like the number one home run that I would tell you guys do this. But times have changed. And one of the worst things you can do in your career is try\n\n00:25:42\tto work on stuff they used to work. Business models that had their glory days. Those glory days are gone. You got to focus on what's working on right now and what's going to work for the next 5 or 10 years. So to summarize with Digital Products 2.0, upfront capital is $100 to $200. Scalability is high. Fulfillment is easy, risk is low, difficulty is easy. And with that, Digital Products 2.0 is the laziest business model out there. You can make tens of thousands of dollars a month with minimal effort in a market that has\n\n00:26:07\tminimal competition and is growing rapidly. Just so you guys understand, let me paint a picture. This is how it stacks up to the other business models. You can see drop shipping is not looking very pretty. SMA still looks pretty appealing. I'd say it's got good statistics across the board. Software, I mean, just forget about affiliate marketing. Once again, pretty good statistics across the board. The issue with affiliate marketing is you're going to have to build a personal brand, which most people don't want to do. I\n\n00:26:28\trecommend it for most people. I think it's a great business. There's very few people that have affiliate marketing as their main income. It's more of kind of like a side thing. So, no disrespect to affiliate marketing, but it's just I really wouldn't call it business model. Whereas digital products 2.0, I mean, look at this. Like, you can't you can't argue this. This is undoubtedly the biggest opportunity in the online space right now. I mean, do you think I would have invested in a platform like if\n\n00:26:48\tI didn't believe in the future of this industry? Listen, I'm extremely logical. I spent two years evaluating every single company in the space, looking at the intimate financials of every single company in the space, looking at the trajectory of the space because when I'm going to make such a massive investment and take a huge stake as a co-owner in such a big company, which quite frankly is a huge financial risk, but I sleep easy at night knowing it's not a risk because I see the trajectory of where\n\n00:27:11\tdigital products are going. And truly, it's like getting involved in e-commerce, in Shopify, in drop shipping 10, 12 years ago. you're coming at just the right time before things explode. And if you get in right now, you're going to be compensated very generously for it. The digital product market is projected to more than double in size over the next 5 years. By 2030, we're looking at almost a trillion a year industry. It's insane. So, quite simply, you have a decision to make. Are you going to get in early and get your slice\n\n00:27:37\tof the cake, or are you going to wait and fight for the crumbs once the market is ultra competitive? That, my friend, is the decision that only you can make. As always, I'm watching from afar and I'm rooting for you.\n\n",
  "filename": "youtube_make_money.txt",
  "information_depth": 2,
  "attention_quality": 0,
  "value_per_minute": -3,
  "novelty_index": -2,
  "spam_score": 4,
  "perspective_awareness": 0,
  "polarity_potential": 0,
  "channel_diversity": null,
  "overall_score": -1.6
}