{
  "domain": "finance",
  "description": "00:00:00\tI know you guys are tired searching for the best ways to make money online. I mean, not your mistake because there are still a lot of videos which talk about, oh, you should try affiliate marketing. You should try captions, subtitles....",
  "full_text": "00:00:00\tI know you guys are tired searching for the best ways to make money online. I mean, not your mistake because there are still a lot of videos which talk about, oh, you should try affiliate marketing. You should try captions, subtitles. I mean, shut up. These things don't work in 2025. So, here are the only real ways that you should try to make your first rupee online. We'll talk about over 25 different ways and divide them into four different buckets. The first bucket is trash. The things that you should never\n\n00:00:26\ttry. The second bucket is easy things which take under 3 months with an earning potential of 20,000 to 25,000 per month. Modate things which take under 8 months with an earning potential of 1 lak per month. And then we have the difficult bucket takes around 2 to 3 years with a potential of 5 to 10 lakh rupees per month. Crazy amount of money. So without wasting any more time, I welcome you to the real ways of making money online in 205. One of the major reasons why students don't end up making any money online\n\n00:00:56\tbecause they get stuck trying the things which actually don't work and it's not your mistake because you have constantly been misguided by multiple people online. So once and for all here's the list of the things that you should never try. The first one is captions and subtitles. I mean this used to be a decent way to make money online before 4 to 5 years but AI has completely killed it. The second one is online surveys. I mean this is so stupid that I don't even want to talk about this. Affiliate\n\n00:01:22\tmarketing. I mean this is one of the biggest traps for students. You see some random YouTuber showing you screenshots of making over 5 lakh rupees through affiliate marketing. So you think you can do it too? For affiliate marketing to work, you need followers, subscribers, and most importantly trust. I mean you can't just drop links and expect money to flow in low-level data entry jobs. I mean you won't believe me but this is even a full-time job for a lot of people even in 2025. And this is so sad because AI is going to eat you up\n\n00:01:46\tall the life. So, if you currently have a data entry job, this is my official warning. Please watch this video till the end and start learning some of the skills because in the next 2 years, you'll definitely lose your job due to AI, NFT flipping, and website testing. Don't even go near them. Number seven, we have microtasks on platforms like Fiverr. This is just okay if you're too free. If you don't know what to do and you immediately need 500 rupees to go out, but rest apart, this is not a good\n\n00:02:08\tidea. Then we have the most popular thing which is trading. Trading is okay if you have good initial capital to invest. But don't be stupid that you can make lacks of money by trading with 500 600 rupees. I mean you can invest, you can do SIP but rest apart this is a very bad idea. On the number nine we have drop shipping. Experts are using AI to identify the winning products and most of the successful drop shippers that you see are full-fledged ecom businesses with very large teams. So it's basically\n\n00:02:31\tbetter for beginners like you to not even get into this. But if you still want to try, you can just let me know in the comments below and I'll talk about how can you do drop shipping with AI in one of my future videos. Now, if you look at all these things, there's a pattern. There's something in common. They're either outdated in 2025 or they have been automated or dominated by AI. And I feel bad for all the students who waste 6 to 8 months of their time trying these stupid things, feeling discouraged, and then entirely\n\n00:02:59\tgiving up on the idea of making money online because in reality, there are some sure shot ways to actually make money online. And that's what we're going to talk about right now. Let's start with the first bucket. What if I told you that you can make your first 20,000 rupees online in just 3 months? There are six things in this bucket which are relatively easy to learn. You don't need like a fancy degree or years of experience. You just need to put in two to three hours of work every single day for the first 1\n\n00:03:25\tmonth and the next month to find your first set of clients. And the first one in the list is short form video editing. You don't need to learn everything about video editing. If you're just going to edit shots or reals for someone, pick a video editing software like Adobe Premiere Pro or D Resolve and learn how to do the basic cuts, few transitions, text overlays, music, and some sound effects. Understand the color psychology and how to pair fonts. All these things together will take you somewhere around\n\n00:03:50\t45 days if you practice them every day for 3 to four hours. And once you feel confident about your skill, make a list of five good real edits that you see on social media and try to replicate editing them. And then make a portfolio website by using the same edits that you have made by using card.io, Notion probably even Vix. Now you can use the same portfolio that you've made to approach people on LinkedIn, Instagram or even by sending emails. And if you're serious about this, you can also join\n\n00:04:11\tthe not just a video team cohort, but thousands of students already started making money through freelancing. The new batch is starting from 1st June. Link is in the description. The second one in the list, we have social media script writing. And this is actually easier than you think it is. Choose any domain that you're passionate about. It can be anything. Tech, science, lifestyle, or even self-help. Now divide the entire script into three parts. the hook, the content and the conclusion. The hook should be something that needs\n\n00:04:35\tto be shocking, extreme, new, promising or even contradictory. The content shouldn't be something that you copy paste from charging up with research and also add your own experience into it. One of the best ways to learn how to write good scripts is to watch a lot of videos. Pick five to six of your favorite creators. Watch a lot of their videos. Try to understand how are they framing their sentences in the hook, in the content, and in the conclusion. You do it for like 40 to 50 videos and you'll\n\n00:04:59\tunderstand how do you write a new script. all by yourself. You can charge anywhere between 2,000 rupees to 10,000 rupees per one YouTube script based upon how complex it is. Writing is lucrative but only if you know how to do it well. Now the third one in the list is to create AI chatbots for small businesses. Even eighth class students will be able to do this by using steps from Chad GP. Local businesses and new startups with like limited resources. They'd love to spend a couple of thousand rupees so\n\n00:05:23\tthat they can automate the most asked questions on the websites. I mean just watch a couple of videos on how to do it and then you can charge like 10,000 rupees per one chatbot setup and also some maintenance every single month. I mean the only problem in this entire process would be like to find these clients and make them understand the importance of this. Let's go to the next one. The fourth one in the list. Now this one is a bit tricky and most of the people who choose this would never make\n\n00:05:45\tany money online because they do it the wrong way. We're talking about designing thumbnails. See making a good thumbnail it's not actually about making good design. It's about evoking that curiosity gap when the thumbnail pops up in front of the audience. You can just watch a couple of tutorials on Canva or Photoshop to learn how to make good designs. But after that, the rest of the skill, it's actually about understanding the psychology of making people click. You can charge 1,000 to 2,000 per\n\n00:06:09\tthumbnail if you're just designing it for someone. But you can charge as high as 10,000 rupees per thumbnail if you're also ideating it and giving the creator a bunch of options to choose from. I mean I can pay you 10,000 rupees per thumbnail if you can do the ideation for me as well. You can find the link in the description below. The fifth one is actually an interesting one. It's about becoming a model, a UGC model, a UGC creator. See this is not traditional modeling where you need to look perfect.\n\n00:06:35\tBrands sometimes just need regular normal people like you to feature on their social media ads. So basically if you just have like a phone and if you can record yourself using their products, brand can actually pay you for the content that you're recording. You don't even need to show your face if you're not comfortable to do it. people end up making 20,000 to 25,000 rupees to create 15 to 20 pieces of content for like different brands per month. And now on the number six, we have internships. A lot of people keep\n\n00:06:59\tasking me Taran, how did you get an internship at IM Bangalore in the second year of college. Back then I wanted to learn more about digital marketing because I was bored studying mechanical engineering. So I started taking random marketing courses online. A couple of free ones like HubSpot content marketing, Google Adwords certification, Google digital marketing certification and like a few more I don't even remember. So then I made a list of all the professors who are in marketing departments at IF. And once I made that\n\n00:07:21\tlist, I started writing them cold emails saying that I wanted to learn more about digital marketing and I'm like more than interested to even do a free internship under that. I sent around 40 to 50 emails. Four to five professors replied and finally one of them gave me a paid internship. That's it. You can also follow the same process to reach out to managers or HRs in like different startups. They would be more than happy to give you an internship if they see a potential in you. Now that is the end of\n\n00:07:47\tthe easy bucket. The things that you can learn in 30 to 45 days and start making somewhere around 20 to 25,000 rupees per month. But here's the problem. Not everyone would be satisfied by just making 20,000 rupees per month. Some people want more. Something which can even potentially replace a full-time highpaying job. So what if I told you that there are ways to make one lakh, two lakh, five lakh or even 10 lakh rupees per month. Because there are people who are doing it right now without any fancy degree or without even\n\n00:08:15\tleaving their home. And honestly, I don't think those people are any smarter than you. They're just like you. 18year-old kids are making over 1 lakh rupees a month. So, let me ask you this. What do you think is the difference between someone making 20,000 rupees per month and someone making 1 lakh rupees per month? It's not just skills, not just connections or not even luck. It's about choosing the right direction, the right skill to pick and having the patience to master it. Welcome to the series, the only 30 real\n\n00:08:39\tways to make money online. And in the previous part, we spoke about all the methods that you should never try and the easy ways to make money which had a potential of 20,000 rupees per month. But in this part, I'm going to talk about the real deal. The methods in the bucket number three and four which take more time to master but can make you 1 lakh to 10 lakh rupees per month. I'm going to tell you everything from what are these methods, how can you learn them, what are the best resources to learn them and so much more. So take out\n\n00:09:02\tyour pen and notebooks because this time you'll need much more than a paper. Making 1 lakh rupees per month is not as difficult as it seems to be. Follow the next five methods that I'm going to talk about. There's a good chance that you can be one of them in the next 1 year. The first one is AI content agency. Brands want more distribution. Founders want more recognition. But no one actually has the time to sit and record content every day. So what's the solution? Simple. You can easily generate AI clones of anyone using Hunen\n\n00:09:30\tand also clone their voice using 11 Labs. These are paid tools but you can easily charge 10x the amount that you're spending on these tools to your clients. You can clone anyone using these tools. Use basic edits, write basic explainer scripts for products or services and charge 10,000 rupees to 40,000 rupees per one explainer video. And it's so crazy that these tools have less than 15,000 visits per week from India. You don't need gear. You don't need big expensive cameras. All you need is a little bit of common sense and know how\n\n00:09:55\tto write basic emails or a message to a potential client. I'll also leave some of the email templates that I use to reach out to clients. I mean, just copy paste me. Method number two is advanced video editing with motion graphics. The key word here is advanced because I'm not talking about simple cuts or transitions anymore. I'm talking about creating animations, complex motion graphics which make a video look professional. You need to first learn simple video editing either on Premier Pro or Dincy Resolve and then learn\n\n00:10:22\tAdobe After Effects. You'll also need to learn design much more proficiently to make these animations look much more cleaner. See, brands pay anywhere between 15,000 to 50,000 rupees for one highquality explainer video. And you can learn all of this in just a matter of like 6 7 months. And if you can learn it well, there's a high chance that you can easily make somewhere around 80,000 to 1 lakh rupees per month. My agency, Adco Bangler, is looking for motion graphic designers both full-time and also\n\n00:10:45\tpart-time. So, if you're interested, the link will be in the description. Now, one more thing which separates a normal video editor from a pro is the use of AI tools in editing. You can just take a screenshot of all these AI tools which you see on the screen right now. I've literally watched over 200 videos and compiled some of the best video editing tutorials on YouTube. You can find that free resource sheet in the description. You see, knowing all these things is fine, but in real life, you won't make\n\n00:11:05\tany progress if you're not tracking what you're doing on a daily basis. I mean, imagine spending hours and hours researching something, and when you look back, you don't even remember what you've been doing. I mean, we in 2025, and there are amazing tools which can help you plan things much better. For example, I use Udu to manage the skills that I'm learning and the business that I run. I've got the entire month planned including the videos, the scripts, the brands, the posting times, all of it. I\n\n00:11:26\tlike it because it offers different views like canban can simplest view and it makes things much easier depending upon what I actually need. For example, in the canban view, I got the ideas dump in the left, ready scripts in the center and the deadlines on the right. Within each of these tasks, I can add deadlines, add more description, add links, use tags to organize. And with the chatter on the right, I can write emails, log notes, and schedule activities like meetings. And the best part is that I can add my team and give\n\n00:11:50\tthem deadlines. See, Odo lets you manage multiple businesses at the same place. It saves me a lot of time and also saves me a lot of mental bandwidth. The best part, the first app is free for a lifetime with unlimited hosting and support. I'll leave the link in the description. I think you should definitely check it out. The third one is web design focusing on small businesses. There's a lot of that people talk about when it comes to web design. And some of them even be like, \"Oh, now you can design websites\n\n00:12:12\tin just one click using AI.\" No, you can't. AI can help you build websites much faster, but you'd still need a human to make the final changes. The step one is to choose a website builder. If you're a complete beginner, you have no money to spend, you should straight up go to guard.io. This is also the best if you're making a portfolio website for yourself. And if you want to build websites for clients, go for Wix. Easy to learn has over 900 templates and you can literally learn it in Wick one day.\n\n00:12:35\tBut if you want more flexibility to design more complex websites, then you should go for framework. You can learn it end to end in a month and can build five to six dummy websites for your portfolio in the next 1 month. But if you want the ultimate flexibility and want to design complex websites, then you should go ahead with web flow. It'll take you 2 to 3 months to learn this end to end. But you can literally charge over 50,000 to 80,000 rupees per month for the websites that you build with this. Making good website designs, it's\n\n00:12:59\tnot so easy because you need to understand colors, fonts, how to pair them. You also need to understand the psychology of where people would end up clicking on the website. So if you're planning to become a web designer, here are the list of the tools which would be very helpful for you. Take a screenshot of it. The next one is being a LinkedIn growth expert powered by AI. You must have heard of LinkedIn ghost writers, but the problem with that is that it's really difficult to scale because you'll\n\n00:13:21\tbe spending hours and hours researching content, writing them, posting them, doing the analytics manually all by yourself. But what if there are tools that can make your life 100x easier? For example, you can use tools like answer the public to research what content is being searched the most in every single domain on every single platform and even get country level analytics. Then you can use the web browser clear to identify the top performing post to take some inspiration. And the moment that\n\n00:13:44\tyou get a few more clients, you can reinvest that money in a tool like Tapio which will automate half of the things that you need to do to grow a LinkedIn page. You just need one good case study that you've grown the LinkedIn page of someone and you can charge premium for all the new clients that you take. Being a LinkedIn growth expert is actually a very lucrative thing. But this is going to be saturated in the next couple of years. So if you're planning to become one, you need to rush. Now before we\n\n00:14:06\ttalk about the last bucket which is the most difficult bucket. We still have to talk about the fifth one in this list which is graphic design for social media. Everyone talks about this but no one actually teaches you how to do it. So here's everything that you need to know. Start with the basic things like design psychology, colors, patterns, fonts, themes and start making simple designs using Canva. I leave the tutorials in the descriptions for all of these. Once you understand the basics of making a good design, learn Photoshop,\n\n00:14:32\tIllustrator and Figma. All these things together should take you a couple of months if you practice well. Once you learn this, the next step is to explore all the AI tools. Tools like UAT, Adobe Sensei, Flux AI, Mid Journey, and a couple of more AI tools. You can also see all the thumbnails that I've been making on this channel and also the Quantum Project channel. All of this is just AI. I'll also attach a tutorial in the description on how you can do the same. See, brands and creators are ready\n\n00:14:54\tto pay you money. It's just that you're not skilled enough. The moment that you understand this, you'll realize why kids of age 15 to 16 are making 1 to 1.5 lakh per month while you're still struggling to buy a burger tonight. And remember the key difference between the methods that we spoke about in the first part of this video series, easy bucket and this method. It's not just the money, but it's also the problem solving ability that you bring to the table. For example, a video editor who can\n\n00:15:17\tguarantee great video retention can charge two to three times the industry standard. A designer who can guarantee more clicks on the CTS can easily charge two to three times of the industry standard. The LinkedIn writer who can guarantee more engagement can again charge two to the t of the industry standard. Because now people are not just paying for your time, they're paying for the results that you drive. And now with that being said, let's talk about the last bucket. The bucket number three, the difficult\n\n00:15:40\tbucket. The things that you can do to make life-changing money. Communication, understanding human emotions, building systems, automating repetitive tasks, dedication, and patience. These are a few skills that you need to build something big. And the first thing in this list is building a 360deree marketing agency. The one that I am running where we don't just provide one or two services but provide multiple services like video production, making ads, making social media content and even performance marketing for\n\n00:16:06\tcompanies. And if you're a beginner, don't start a 360deree marketing agency directly. Start small. Choose one single skill like design or video editing. Freelance for a couple of years. Build a team and then expand to more services. It's easier to penetrate the market deeper first and then expand horizontally than doing it reverse. Midsized agency owners in India make anywhere from 4 lakh rupees to 15 lakh rupees per month. So much money. The second one in this list is probably the most difficult one in this list and that\n\n00:16:32\tis going the traditional startup way. But this is especially wonderful if you're also studying in a great college like IIT Bates or any other tier one college because it will be easier for you to raise funds and also at the same time do not fall into the trap of coming up with like new startup ideas all the time. Ideas don't really matter much in the startups. You don't need a great unique idea. You just need solid execution and that's what matters in startups. Now with that being said, let's go to the last one in this bucket\n\n00:16:58\twhich is my personal favorite and that is building your own personal brand. In other words, content creation. If you can give me the next 2 minutes, I'll tell you how can you hit 10,000 followers on LinkedIn, YouTube or Instagram in the next 1 year. Let's start with the platforms. LinkedIn is the easiest to crack followed by Instagram and YouTube being the most difficult one. People never grow on any of these platforms because they consider it's luck but it's not. It's pure science, a set of skills that everyone\n\n00:17:23\tcan master, even you. Maybe a beautiful looking girl or a man with a six-pack can grow faster than you on Instagram. But that doesn't mean that you can't grow. It just means that they have some unfair advantage. So find your unfair advantage and use it for your benefit. I've done a lot of research and made three separate playlists on how can you grow on LinkedIn, Instagram, and YouTube. You can learn most of the basic things from these videos. Post two to three times a week and do not give up for one year. Most of the channels or\n\n00:17:48\tpages usually grow the most during the second year of the operation. And remember, it doesn't matter if you're a normal student, an engineer, a doctor, or even a lawyer. Having some kind of social presence is going to be hugely helpful for you in your life. These methods usually take 3 to 4 years to get to 5 to 10 lakh per month. But here's why none of you would be able to reach that stage. Sounds harsh, but I mean it. The biggest problem that you guys have, the ones who are watching me right now,\n\n00:18:13\tis called the shiny object syndrome. You'll first start watching a couple of videos on video editing and then you'll start doing that for a couple of weeks and then you'll watch videos on designing and do that for a couple of weeks and then you'll get into trading, coding, drop shipping and you literally do everything which seems fancy. Remember you can do anything but not everything. And if you're trying to do everything, you're basically doing nothing. And please pick one thing and stick to it for 3 to 6 months. And if\n\n00:18:36\tyou still don't see the results, then move on to something else. The real money is in doing the same boring things every day. Now, here's a fun challenge. I challenge you to pick up one skill, let me know whatever that is in the comments below. And after 3 months of trying it, come back, reply to the same comment and share your stories and progress. It'll be an amazing thing for you because you'll be documenting your journey, but also at the same time for other people, it'll be a motivation creating through your success stories.\n\n00:19:01\tSee, this year I really want you guys to win. So, please choose a skill and start working hard. All the best. [Music]\n\n",
  "filename": "youtube_25_ways_to_make_money.txt",
  "information_depth": 1,
  "attention_quality": -1,
  "value_per_minute": 3,
  "novelty_index": 1,
  "spam_score": 3,
  "perspective_awareness": -2,
  "polarity_potential": 0,
  "channel_diversity": null,
  "overall_score": -0.45
}